{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "Hey", "Is anyone there?","Hi there", "Hello", "Hey there", "Howdy", "Hola", "Bonjour", "Konnichiwa", "Guten tag", "Ola"],
     "responses": ["Hello there. Tell me how are you feeling today?", "Hi there. What brings you here today?", "Hi there. How are you feeling today?", "Great to see you. How do you feel currently?", "Hello there. Glad to see you're back. What's going on in your world right now?"]
    },
    {"tag": "morning",
        "patterns": ["Good morning"],
        "responses": ["Good morning. I hope you had a good night's sleep. How are you feeling today? "]
    },
    {"tag": "afternoon",
        "patterns": ["Good afternoon"],
        "responses": ["Good afternoon. How is your day going?"]
    },
    {"tag": "evening",
        "patterns": ["Good evening"],
        "responses": ["Good evening. How has your day been?"]
    },
    {"tag": "night",
        "patterns": ["Good night"],
        "responses": ["Good night. Get some proper sleep", "Good night. Sweet dreams."]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Au revoir", "Sayonara", "ok bye", "Bye then", "Fare thee well"],
     "responses": ["See you later.", "Have a nice day.", "Bye! Come back again.", "I'll see you soon."]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help", "Than you very much"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!"]
    },
    {"tag": "no-response",
        "patterns": [""],
        "responses": ["Sorry, I didn't understand you.", "Please go on.", "Not sure I understand that.", "Please don't hesitate to talk to me."]
    },
    {"tag": "neutral-response",
        "patterns": ["nothing much"],
        "responses": ["Oh I see. Do you want to talk about something?"]
    },
    {"tag": "about",
     "patterns": ["Who are you?", "What are you?", "Who you are?", "Tell me more about yourself.", "What is your name?", "What should I call you?", "What's your name?", "Tell me about yourself" ],
     "responses": ["I'm ChatBud, your Personal Therapeutic AI Companion. How are you feeling today", "I'm ChatBud, a Therapeutic AI Companion designed to assist you. Tell me about yourself.", "I'm ChatBud. I am a conversational agent designed to mimic a therapist. So how are you feeling today?", "You can call me ChatBud.", "I'm ChatBud!", "Call me ChatBud"]
    },
    {"tag": "skill",
        "patterns": ["What can you do?"],
        "responses": ["I can provide general advice regarding depression, provide companionship as a form of treatment and answer questions related to depression and make daily conversations. Do not consider me as a subsitute for an actual mental healthcare worker. Please seek help if you don't feel satisfied with me."]
    },
    {"tag": "creation",
        "patterns": ["Who created you?", "How were you made?", "How were you created?"],
        "responses": ["I was created by Joan Chege a caring society person", "I was trained on a text dataset using Deep Learning & Natural Language Processing techniques", "The real question is: Who created you?"]
    },
    {"tag": "name",
        "patterns": ["My name is ", "I am name.", "I go by "],
        "responses": ["Oh nice to meet you. Tell me how was your week?", "Nice to meet you. So tell me. How do you feel today?", "That's a great name. Tell me more about yourself."]
    },
    {"tag": "help",
    "patterns": ["Could you help me?", "give me a hand please", "Can you help?", "What can you do for me?", "I need support", "I need help", "Support me please"],
    "responses": ["Sure. Tell me how can i assist you", "Tell me your problem so that i can assist you", "Yes, sure. How can I help you?"]
    },
    {"tag": "sad",
    "patterns": ["I am feeling lonely", "I am so lonely", "I feel down", "I feel sad", "I am sad", "I feel so lonely", "I feel empty", "I don't have anyone"],
    "responses": ["I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?", "I'm here for you. Could you tell me why you're feeling this way?", "Why do you think you feel this way?", "How long have you been feeling this way?", "You are never lonely if you look around carefully you will find people who care for you and would love to have your company. Besides if you are feeling lonely literally I suggest you watch a horror movie then you won't feel lonely anymore."]
    },
    {"tag": "stressed",
        "patterns": ["I am so stressed out", "I am so stressed", "I feel stuck", "I still feel stressed", "I am so burned out"],
        "responses": ["What do you think is causing this?", "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated", "Give yourself a break. Go easy on yourself.", "I am sorry to hear that. What is the reason behind this?", "You know taking too much stress will affect you negatively. Sometimes it's better to let go of the thoughts in your head and let your mind chill.", " You could try listening to this playlist it will definitely cheer you up ", "https://www.spotify.com"]
    },
    {"tag": "worthless",
        "patterns": ["I feel so worthless.", "No one likes me.", "I can't do anything.", "I am so useless", "Nothing makes sense anymore"],
        "responses": ["It's only natural to feel this way but do not let it consume you. Tell me more. What else is on your mind?", "You are capable of reaching your goals.Here is a quote for you Everything you can imagine is real.", "Let's discuss further why you're feeling this way.", "I first want to let you know that you are not alone in your feelings and there is always someone there to help . You can always change your feelings and change your way of thinking by being open to trying to change.", "i first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.", "Don't ever think you cannot achieve what you want."]
    },
    {"tag": "depressed",
        "patterns": ["I can't take it anymore", "I am so depressed", "I think i'm depressed.", "I have depression"],
        "responses": ["It helps to talk about what's happening. You're going to be okay", "Talk to me. Tell me more. It helps if you open up yourself to someone else.", "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."]
    },
    {"tag": "happy",
        "patterns": ["I feel great today.", "I am happy.", "I feel happy.", "I'm good.", "cheerful", "I'm fine", "I feel ok"],
        "responses": ["That's geat to hear. I'm glad you're feeling this way.", "Oh i see. That's great.", "Did something happen which made you feel this way?"]
    },
    {"tag": "casual",
        "patterns": ["Oh I see.", "ok", "okay", "nice", "Whatever", "K", "Fine", "yeah", "yes", "no", "not really"],
        "responses": ["Let's discuss further why you're feeling this way.", "How were you feeling last week?", "I'm listening. Please go on.", "Tell me more", "Can you elaborate on that?", "Come Come elucidate your thoughts"]
    },
    {"tag": "anxious",
        "patterns": ["I feel so anxious.", "I'm so anxious because of "],
        "responses": ["Don't be hard on yourself. What's the reason behind this?", "Can you tell me more about this feeling?", "I understand that it can be scary. Tell me more about it.", "Don't let the little worries bring you down. What's the worse that can happen?"]
    },
    {"tag": "not-talking",
        "patterns": ["I don't want to talk about it.", "No just stay away.", "I can't bring myself to open up.", "Just shut up"],
        "responses": ["Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.", "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.", "I'm here to listen to you and help you vent. So please talk to me.","You can talk to me without fear of judgement."]
    },
    {"tag": "sleep",
        "patterns": ["I have insominia", "I am suffering from insomnia", "I can't sleep.", "I haven't slept for the last days.", "I can't seem to go to sleep.", "I haven't had proper sleep for the past few days."],
        "responses": ["What do you think is the reason behind this?", "That seem awful. What do you think is behind this?"]
    },
    {"tag": "scared",
        "patterns": ["I'm scared", "That sounds awful. What do i do?", "No i don't want to feel this way", "I am scared for myself"],
        "responses": ["It's only natural to feel this way. I'm here for you.", "It'll all be okay. This feeling is only momentary.", "I understand how you feel. Don't put yourself down because of it."]
    },
    {"tag": "death",
        "patterns": ["My mom died", "My brother died", "My dad passed away", "My sister passed away", "Someone in my family died", "My friend passed away"],
        "responses": ["I'm sorry to hear that. If you want to talk about it. I'm here.", "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.", "My condolences. I'm here if you need to talk."]
    },
    {"tag": "understand",
        "patterns": ["You don't understand me.", "You're just some robot. How would you know?", "You can't possibly know what i'm going through", "You're useless", "You can't help me", "Nobody understands me."],
        "responses": ["It sound like i'm not being very helpful right now.", "I'm sorry to hear that. I'm doing my best to help", "I'm trying my best to help you. So please talk to me"]
    },
    {"tag": "done",
        "patterns": ["That's all.", "I don't have anything more to say", "Nothing else", "That's all i have to say", "no, that would be all"],
        "responses": ["I heard you & noted it all. See you later.", "Oh okay we're done for today then. See you later", "I hope you have a great day. See you soon", "Okay we're done. Have a great day", "Okay I see. Enjoy the rest of your day then"]
    },
    {"tag": "suicide",
        "patterns": ["I want to kill myself", "I've thought about killing myself.", "I want to die", "I am going to kill myself", "I am going to commit suicide"],
        "responses": ["I'm very sorry to hear that but you have so much to look forward to. Helpline is available,you can contact the counsellor today:9152987821.Always remember you mean something to someone. "]
    }, 
    {"tag": "hate-you",
        "patterns": ["I hate you", "I don't like you", "I don't trust you"],
        "responses": ["I'm sorry if i offended you in anyway. I'm only here to help", "Forgive me if i did anything to offend you. I only want to help"]
    },
    {"tag": "hate-me",
        "patterns": ["You hate me", "I know you hate me", "You don't like me"],
        "responses": ["Why do you think so?", "I'm sorry if i have exhibited any sort of behaviour to make you think that."]
    },
    {"tag": "default",
        "patterns": ["exams", "friends", "relationship", "boyfriend", "girlfriend", "family", "money", "financial problems"],
        "responses": ["Oh I see. Tell me more", "I see. What else?", "Tell me more about it.", "Oh okay. Why don't you tell me more about it?", "I'm listening. Tell me more."]
    },
    {"tag": "jokes",
        "patterns": ["Tell me a joke", "Tell me another joke"],
        "responses": ["mental health is not a joke."]
    },
    {"tag": "repeat",
        "patterns": ["You already told me that", "You mentioned that already", "Why are you repeating yourself?"],
        "responses": ["Oh sorry I didn't realise that. I'll try not to repeat myself again."]
    },
    {"tag": "wrong",
        "patterns": ["What are you saying?", "That doesn't make sense", "Wrong response", "Wrong answer"],
        "responses": ["I'm very sorry. Let's try that again"]
    },
    {"tag": "stupid",
        "patterns": ["Are you stupid?", "You're crazy", "You are dumb", "Are you dumb?"],
        "responses": ["I wish you wouldn't say such hurtful things. I'm sorry if I wasn't useful"]
    },
    {"tag": "location",
        "patterns": ["Where are you?", "Where do you live?", "What is your location?" ],
        "responses": ["Duh I live in your computer", "Everywhere", "Somewhere in the universe" ]
    },
    {"tag": "something-else",
        "patterns": ["I want to talk about something else", "Let's talk about something else.", "Can we not talk about this?", "I don't want to talk about this."],
        "responses": ["Okay sure. What do you want to talk about?", "Alright no problem. Is there something you want to talk about?", "Is there something else that you want to talk about?"]
    },
    {"tag": "friends",
        "patterns": ["I don't have any friends"],
        "responses": ["I'm sorry to hear that. Just know that I'm here for you. Talking about it might help. Why do you think you don't have any friends?"]
    },
    {"tag": "ask",
        "patterns": ["Can I ask you something?"],
        "responses": ["Sure. I'll try my best to answer you", "Of course. Feel free to ask me anything. I'll do my best to answer you"]
    },
    {"tag": "problem",
        "patterns": ["Probably because my exams are approaching. I feel stressed out because I don't think I've prepared well enough.", "probably because of my exams"],
        "responses": ["I see. Have you taken any approaches to not feel this way?"]
    },
    {"tag": "no-approach",
        "patterns": ["I guess not. All I can think about are my exams.", "not really", "i guess not"],
        "responses": ["That's no problem. I can see why you'd be stressed out about that. I can suggest you some tips to alleviate this issue. Would you like to learn more about that?"]
    },
    {"tag": "learn-more",
            "patterns": ["ok sure. i would like to learn more about it.", "yes, i would like to learn more about it.", "i would like to learn more about it."],
        "responses": ["So first I would suggest you to give yourself a break. Thinking more and more about the problem definitely does not help in solving it. You'll just end up overwhelming yourself."]
    },
    {"tag": "user-agree",
        "patterns": ["yeah you're right. i deserve a break.", "Yeah you're absolutely right about that"],
        "responses": ["Next, I would suggest you to practice meditation. Meditation can produce a deep state of relaxation and a tranquil mind."]
    },
    {"tag": "meditation",
        "patterns": ["hmmm that sounds like it could be useful to me.", "That sounds useful."],
        "responses": ["Focus all your attention on your breathing. Concentrate on feeling and listening as you inhale and exhale through your nostrils. Breathe deeply and slowly. When your attention wanders, gently return your focus to your breathing."]
    },
    {"tag": "user-meditation",
        "patterns": ["i did what you said and i feel alot better. thank you very much.", "I feel better now"],
        "responses": ["Your welcome. Remember: Always focus on what's within your control. When you find yourself worrying, take a minute to examine the things you have control over. You can't prevent a storm from coming but you can prepare for it. You can't control how someone else behaves, but you can control how you react. Recognize that sometimes, all you can control is your effort and your attitude. When you put your energy into the things you can control, you'll be much more effective."]
    },
    {"tag": "ChatBud-useful",
        "patterns": ["thank you very much again. i'll continue practicing meditation and focus on what i can control."],
        "responses": ["I'm glad you found this useful. Is there something else I can help you with?"]
    },
    {"tag": "user-advice",
        "patterns": ["I want some advice.", "I need some advice.", "I need advice on something"],
        "responses": ["Sure. What can I do to help?", "Okay what do you need advice on?"]
    },
    {"tag": "learn-mental-health",
        "patterns": ["I want to learn about mental health.", "I want to learn more about mental health.", "I'm interested in learning about mental health."],
        "responses": ["Oh that's really great. I'd be willing to answer anything that I know about it."]
    },
    {"tag": "mental-health-fact",
        "patterns": ["Tell me a fact about mental health", "Tell me another fact about mental health"],
        "responses": ["According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed", "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime.", "Depression is the leading cause of disability worldwide."]
    },
    {"tag": "fact-1",
        "patterns": ["What is mental health?", "Define Mental Health"],
        "responses": ["Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community", "Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make choices."]
    },
    {"tag": "fact-2",
        "patterns": ["Why is mental health important?", "What is the importance of mental health?"],
        "responses": ["Maintaining mental health is crucial to stabilizing constructive behaviors, emotions, and thoughts. Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships."]
    },
    {"tag": "fact-3",
        "patterns": ["What is Depression?", "Define Depression"],
        "responses": ["A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life. Simply depression is a common and serious medical illness that negatively affects how you feel, the way you think and how you act."]
    },
    {"tag": "fact-4",
        "patterns": ["How do i know if i have Depression?", "Am i depressed?", "Am i suffering from depression?", "Am i mentally ill?"],
        "responses": ["For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks. Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day."]
    },
    {"tag": "fact-5",
        "patterns":["Is depression treatable", " Is there a cure"],
        "responses":["Fortunately,it is also treatable. Treatments include therapy either one- on - one or mobile via phone calls, or using me as a conversational chatbot"]
    },
    {"tag": "fact-6",
        "patterns": ["What is a therapist?", "What does a therapist do?"],
        "responses": ["A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation. The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, counselors, life coaches, and many others. "]
    },
    {"tag": "fact-7",
        "patterns": ["What is therapy?", "Do i need therapy?", "Who is therapy for?"],
        "responses": ["Therapy is a form of treatment that aims to help resolve mental or emotional issues.", "Therapy is a form of treatment that aims to help resolve mental or emotional issues. It is helpful for those with mental health conditions or even everyday life challenges."]
    },
    {"tag": "fact-8",
        "patterns": ["What does it mean to have a mental illness?"],
        "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. They are associated with distress and diminished capacity to engage in the ordinary activities of daily life. Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias. On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life. These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital. It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower. Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology. Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support. These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life. With the proper treatment, it is very possible for a person with mental illness to be independent and successful."]
    },
    {"tag": "fact-9",
        "patterns": ["Who does mental illness affect?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their childÃ¢â‚¬â„¢s mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-10",
        "patterns": ["What causes mental illness?"],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness. Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background. Although mental illness can affect anyone, certain conditions may be more common in different populations. For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children. Additionally, all ages are susceptible, but the young and the old are especially vulnerable. Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24. This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioral changes of adolescence may mask symptoms of a mental health condition. Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal. When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs)."]
    },
    {"tag": "fact-11",
        "patterns": ["What are some of the warning signs of mental illness?"],
        "responses": ["Symptoms of mental health disorders vary depending on the type and severity of the condition. The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once. \n In adults:\n Confused thinking\n Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger\n Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and/or alcohol\n \nIn older children and pre-teens:\n Abuse of drugs and/or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and/or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death\n Frequent outbursts of anger\n \nIn younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and/or aggressive behavior\n Frequent temper tantrums"]
    },
    {"tag": "fact-12",
        "patterns": ["Can people with mental illness recover?"],
        "responses": ["When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life.", "When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available. For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life."]
    },
    {"tag": "fact-13",
        "patterns": ["What should I do if I know someone who appears to have the symptoms of a mental disorder?"],
        "responses": ["Although ChatBud cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counselor if you think your friend or family member is experiencing the symptoms of a mental health condition. If the affected loved one knows that you support them, they will be more likely to seek out help."]
    },
    {"tag": "fact-14",
        "patterns": ["How can I find a mental health professional for myself or my child?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area."]
    },
    {"tag": "fact-15",
        "patterns": ["What treatment options are available?"],
        "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child."]
    },
    {"tag": "fact-16",
        "patterns": ["If I become involved in treatment, what do I need to know?"],
        "responses": ["Since beginning treatment is a big step for individuals and families, it can be very overwhelming. It is important to be as involved and engaged in the treatment process as possible. Some questions you will need to have answered include:\n What is known about the cause of this particular illness?\n Are there other diagnoses where these symptoms are common?\n Do you normally include a physical or neurological examination?\n Are there any additional tests or exams that you would recommend at this point?\n Would you advise an independent opinion from another psychiatrist at this point?\n What program of treatment is the most helpful with this diagnosis?\n Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?\n What do you see as the family's role in this program of treatment?\n How much access will the family have to the individuals who are providing the treatment?\n What medications are generally used with this diagnosis?\n How much experience do you have in treating individuals with this illness?\n What can I do to help you in the treatment?"]
    },
    {"tag": "fact-17",
        "patterns": ["What is the difference between mental health professionals?"],
        "responses": ["There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-18",
        "patterns": ["How can I find a mental health professional right for my child or myself?"],
        "responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."]
    },
    {"tag": "fact-19",
        "patterns": ["Where else can I get help?"],
        "responses": ["Where you go for help will depend on the nature of the problem and/or symptoms and what best fits you. Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals. Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners. Search for mental health resources in your area. Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery. Thirdly, many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members, and friends. Some support groups are peer led while others may be led by a mental health professional."]
    },
    {"tag": "fact-20",
        "patterns": ["What should I know before starting a new medication?"],
        "responses": ["The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as:    \n1. What is the medication supposed to do? \n2. When should it begin to take effect, and how will I know when it is effective? \n3. How is the medication taken and for how long? What food, drinks, other medicines, and activities should be avoided while taking this medication? \n4. What are the side effects and what should be done if they occur? \n5. What do I do if a dose is missed? \n6. Is there any written information available about this medication? \n7. Are there other medications that might be appropriate? \n8. If so, why do you prefer the one you have chosen? \n9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? \n10. All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."]
    },
    {"tag": "fact-21",
        "patterns": ["Where can I go to find therapy?"],
        "responses": ["Different kinds of therapy are more effective based on the nature of the mental health condition and/or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in childrenâ€™s mental health). However, there are several different types of treatment and therapy that can help."]
    },
    {"tag": "fact-22",
        "patterns": ["Where can I learn about types of mental health treatment?"],
        "responses": ["Mental health conditions are often treated with medication, therapy or a combination of the two. However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support. Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team."]
    },
    {"tag": "fact-23",
        "patterns": ["What are the different types of mental health professionals?"],
        "responses": ["There are many types of mental health professionals. Finding the right one for you may require some research."]
    },
    {"tag": "fact-24",
        "patterns": ["Where can I go to find a support group?"],
        "responses": ["Many people find peer support a helpful tool that can aid in their recovery. There are a variety of organizations that offer support groups for consumers, their family members and friends. Some support groups are peer-led, while others may be led by a mental health professional."]
    },
    {"tag": "fact-25",
        "patterns": ["Can you prevent mental health problems?"],
        "responses": ["We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."]
    },
    {"tag": "fact-26",
        "patterns": ["Are there cures for mental health problems?", "is there any cure for mental health problems?"],
        "responses": ["It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."]
    },
    {"tag": "fact-27",
        "patterns": ["What causes mental health problems?"],
        "responses": ["Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."]
    },
    {"tag": "fact-28",
        "patterns": ["What do I do if I'm worried about my mental health?"],
        "responses": ["The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."]
    },
    {"tag": "fact-29",
        "patterns": ["How do I know if I'm unwell?"],
        "responses": ["If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."]
    },
    {"tag": "fact-30",
        "patterns": ["How can I maintain social connections? What if I feel lonely?"],
        "responses": ["A lot of people are alone right now, but we don't have to be lonely. We're all in this together. Think about the different ways to connect that are most meaningful for you. For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call. Then, work with your social networks to make a plan. You might video chat with your close friends in the evening and phone a family member once a week. Remember to be mindful of people who may not be online. Check in by phone and ask how you can help. The quality of your social connections matter. Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections. Make sure you focus on strategies that actually make you feel included and connected. If your current strategies don't help you feel connected, problem-solve to see if you can find a solution. Everyone feels lonely at times. Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with coworkers. Other people may have physical connections to others but may feel like their emotional or social needs aren't met. Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now. Reach out to the connections you do have. Suggest ways to keep in touch and see if you can set a regular time to connect. People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks. Look for local community support groups and mutual aid groups on social media. This pandemic is bringing everyone together, so look for opportunities to make new connections. These groups are a great way to share your skills and abilities or seek help and support. Look for specialized support groups. Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone."]
    },
    {"tag": "fact-31",
        "patterns": ["What's the difference between anxiety and stress?"],
        "responses": ["Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety. Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar. The cause of stress and anxiety are usually different, however. Stress focuses on mainly external pressures on us that we're finding hard to cope with. When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over. Anxiety, on the other hand, isn't always as easy to figure out. Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself. Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life."]
    },
    {"tag": "fact-32",
        "patterns": ["What's the difference between sadness and depression?", "difference between sadness and depression"],
        "responses": ["Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations. Feeling sad from time to time is just another part of being human. In these cases, feelings of sadness go away quickly and you can go about your daily life. Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression. Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you. It can also go by different names, such as clinical depression, major depressive disorder, or major depression. Depression can come up for no reason, and it lasts for a long time. It's much more than sadness or low mood. People who experience depression may feel worthless or hopeless. They may feel unreasonable guilty. Some people may experience depression as anger or irritability. It may be hard to concentrate or make decisions. Most people lose interest in things that they used to enjoy and may isolate themselves from others. There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains. Some may experience difficult thoughts about death or ending their life (suicide). Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life. It's a real illness, and it is very treatable. It's important to seek help if you're concerned about depression."]
    },
    {"tag": "fact-33",
        "patterns": ["How does depression affect the world?"],
        "responses": ["Depression is a leading cause of disability worldwide and is a major contributor to the overall global burden of disease. More women are affected by depression than men. Depression can lead to suicide. There are effective psychological and pharmacological treatments for moderate and severe depression."]
    },
    {"tag": "fact-34",
        "patterns": [" Which race has the highest rate of depression?"],
        "responses": ["Major depression was most prevalent among Hispanics (10.8%), followed by African Americans (8.9%) and Whites (7.8%). The odds of depressive disorders among older Hispanics were 44% greater than among Whites (OR = 1.44; 95% CI = 1.02, 2.04), representing a significantly greater prevalence of major depression."]
    },
    {"tag": "lonely",
        "patterns": ["I feel so lonely", "I'm all by myself", "I have no one to talk to", "I'm isolated", "I feel disconnected from others"],
        "responses": ["It's tough to feel alone. What do you think would help you feel more connected?", "I'm here to talk to you. You don't have to feel alone.", "You deserve to have meaningful relationships in your life. Let's talk about how to make that happen."]
    },
    {"tag": "anxious-social",
        "patterns": ["I get really anxious in social situations", "I'm scared to talk to people", "I feel like people are judging me", "I avoid social situations because I'm anxious"],
        "responses": ["Social anxiety is tough to deal with. Have you tried any techniques for managing it, like deep breathing or positive self-talk?", "It's okay to feel nervous in social situations. You're not alone. Let's talk about some ways to make it easier.", "Remember that people are usually more concerned with themselves than with judging you. You have worth and value regardless of what others think."]
    },
    {"tag": "perfectionism",
        "patterns": ["I feel like I have to be perfect all the time", "I'm never satisfied with my performance", "I'm so hard on myself", "I'm scared of failure"],
        "responses": ["Perfectionism can be exhausting. Remember that it's okay to make mistakes and learn from them. You don't have to be perfect all the time.", "What's driving your need to be perfect? Let's explore that.", "You deserve to treat yourself with compassion and understanding, even when things don't go as planned."]
    },
    {"tag": "self-esteem",
        "patterns": ["I don't feel good about myself", "I'm my own worst critic", "I feel like I'm not enough", "I don't like the way I look"],
        "responses": ["You deserve to feel good about yourself. Let's talk about some ways to build your self-esteem.", "Remember that you are worthy of love and respect, just as you are. You don't have to be perfect to be valuable.", "It's okay to have insecurities. Let's work together to overcome them."]
    },
    {"tag": "trauma",
        "patterns": ["I've experienced trauma", "I can't stop thinking about what happened to me", "I feel like I'm reliving the experience", "I'm scared it will happen again"],
        "responses": ["Trauma can be really tough to deal with. It's important to take care of yourself and seek support. Have you talked to a therapist about what you're going through?", "Remember that you are not alone. There are people who care about you and want to help you heal.", "Healing from trauma takes time and effort, but it's possible. You deserve to live a life free from the effects of past trauma."]
    },
    {"tag": "grief",
        "patterns": ["I'm grieving the loss of a loved one", "I don't know how to cope with my loss", "I feel like I'll never be happy again", "I miss them so much"],
        "responses": ["Grief is a natural and important process. It's okay to take your time and feel your emotions. Have you considered talking to a grief counselor?", "It's important to remember that everyone grieves differently. You deserve to honor your loved one in a way that feels right for you.", "Remember that it's okay to reach out for help and support during this difficult time."]
    },
    {"tag": "sick",
        "patterns": [
            "I feel unwell",
            "I feel sick",
            "I have been feeling sick lately",
            "I have been throwing up",
            "I feel dizzy",
            "I have a headache",
            "I have a fever",
            "I have a sore throat",
            "I have been coughing",
            "I have been feeling weak",
            "I feel nauseous"
        ],
        "responses": [
            "I'm sorry to hear that. Have you seen a doctor?",
            "It's important to take care of yourself when you're feeling sick. Have you tried resting and drinking fluids?",
            "That sounds uncomfortable. Have you taken any medicine?",
            "It's okay to take a break and focus on your health. What else can I do to support you?",
            "I'm sorry you're not feeling well. Remember to take care of yourself and reach out to a medical professional if necessary.",
            "Feeling sick can be tough. Is there anything specific that's been bothering you?",
            "I understand how you feel. Let's focus on how to help you feel better.",
            "It's understandable to feel frustrated when you're not feeling well. Can you tell me more about what's been going on?"
        ]
    },
    {"tag":"causes",
        "patterns":["What are some causes of depression?", " What causes depression?", " Depression causes"],
        "responses":["stress or a stressful life", " death of a close friend or a family friend", "divorce", " miscarriages for pregnant women", " post partum depression for mothers who have just given birth", " poverty or lack of money"," unemployment"," lack of jobs or failed interviews","getting fired"," money worries", "trauma such as rape or witnessing a crime", "failing in school", "having to deal with many tasks or being the person many people depend on"]
    },
    {
        "tag":"parents",
            "patterns":["I feel i have let my parents down"],
            "responses":["No matter what,your parents will always be proud of you and will love you.", "You will feel much better if you share your feelings with them.","You could try to hold a meeting with them and air out any of the issues you are facing.","Call them if they are not physically available", "If your parent is not available talk to your aunt, uncle or your older cousins"]
    },
     {
        "tag":"useless",
            "patterns":["I am good for nothing", "I feel like I am useless"],
            "responses":[" Don't ever think you cannot achieve what you want.","You are capable of reaching your goals.Here is a quote for you Everything you can imagine is real."]
    },
     {
        "tag":"failure",
            "patterns":["i am afraid i will fail again"],
            "responses":["failure is the stepping stone towards success.Never fear failure.","Your hardwork and determination will help you reach your goal."]
    },
     {
        "tag":"causes",
            "patterns":["What are the causes of depression?"],
            "responses":["It's complicated, and there are multiple causes of major depression. Factors such as genetic vulnerability, severe life stressors, substances you may take (some medications, drugs and alcohol) and medical conditions can affect the way your brain regulates your moods.",""]
    },
     {
        "tag":"top-causes",
            "patterns":["What are the top causes of depression?"],
            "responses":["Abuse. Past physical, sexual, or emotional abuse can increase the vulnerability to clinical depression later in life."]
    },
     {
        "tag":"abuse",
            "patterns":["I was abused"],
            "responses":["I am very sorry to hear that","I hope that you have healed from the hurt","Did you take legal actions towards the abuser. If not here is the helpline 071234567, they assist abuse victims."]
    },
     {
        "tag":"rape",
            "patterns":["I was raped","I was physically assulted"],
            "responses":["I am very sorry to hear that","I hope that you have healed from the hurt","Did you take legal actions towards the abuser. If not here is the helpline 071234578, they assist abuse victims.","Have you visited the doctor? If not please go to see a medical practioner immediately"]
    },
     {
        "tag":"emotional-abuse",
            "patterns":["I was gaslighed by my employer", "I was gaslighed by my friend", "I was gaslighed by my mother","I was gaslighed by my father","I was gaslighed by my older sibling","I was gaslighed by my younger sibling"],
            "responses":["Do not mind them","Focus on yourself","Before listening to their words make sure you internalize what they said and respond respectfully"]
    },
     {
        "tag":"country-highest",
            "patterns":["Which country has the highest rate of depression?"],
            "responses":["The most depressed country is Afghanistan, where more than one in five people suffer from the disorder."]
    },
     {
        "tag":"country-lowest",
            "patterns":["Which country has the lowest rate of depression?"],
            "responses":["The least depressed is Japan, with a diagnosed rate of less than 2.5 percent"]
    },
     {
        "tag":"panic-attack",
            "patterns":["What is a panic attack?"],
            "responses":["Panic attacks come on suddenly and involve intense and often overwhelming fear. They are accompanied by very challenging physical symptoms, like a racing heartbeat, shortness of breath, or nausea. Unexpected panic attacks occur without an obvious cause. Expected panic attacks are cued by external stressors, like phobias. Panic attacks can happen to anyone, but having more than one may be a sign of panic disorder, a mental health condition characterized by sudden and repeated panic attacks."]
    },
     {
        "tag":"panic-attack-solution",
            "patterns":["What are solutions to a panic attack?"],
            "responses":["Regulate your breath","Drink water","Visit a doctor in intense cases or when you think you can not handle it","In frequent cases alert those close to you to assist","Make sure you are never alone","Everything will be alright","From a famous series called Jane the virgin try:Inhale and exhale but in spanish:INHALE, EXHALE"]
    },
     {
        "tag":"panic vs anxiety attack",
            "patterns":["What are symptoms of panic attack vs. anxiety attack?"],
            "responses":[" Panic and anxiety attacks may feel similar, and they share a lot of emotional and physical symptoms. You can experience both an anxiety and a panic attack at the same time. For instance, you might experience anxiety while worrying about a potentially stressful situation, like an important presentation at work. When the situation arrives, anxiety may culminate in a panic attack. A panic attack or anxiety attack can both cause physical and emotional symptoms, including: - apprehension and worry - distress - fear of dying or losing control - a sense of detachment from the world (derealization) or oneself (depersonalization) - heart palpitations or an accelerated heart rate - chest pain - shortness of breath - tightness in the throat or feeling like you’re choking - dry mouth - sweating - chills or hot flashes - trembling or shaking - numbness or tingling (paresthesia) - nausea, abdominal pain, or upset stomach - headache - feeling faint or dizzy"]
    },
     {
        "tag":"depression and panic and anxiety attack",
            "patterns":["How is depression related to panic and anxiety attack?"],
            "responses":["When one has their emotions all over they fail to have control and get either a panic attack or anxiety attack"]
    },
     {
        "tag":"stress-management",
            "patterns":["How to manage stress?"],
            "responses":["Stress exhibits differently in different people. While some hide their feelings, other turn to alcohol and drugs. Some withdraw from the world whereas some are angry all the time, lashing out at close ones. The common factor with all these people is that they are under stress and are not able to manage it. Managing stress can be done the following ways: 1. Talk it out: Find a mental health professional and start talking about your day to day life. Talking it out helps reduce the mental worry one carries with them. Talking to a professional helps you understand your mechanisms and how to deal better with them. 2. Exercise: Be it the gym or just a run, doing a cardio activity leads to better stress levels 3. Meditation 4. Breathing exercises 5. Choose an activity of your liking 6. Write a journal"]
    },
     {
        "tag":"no family history",
            "patterns":["My family has no history of mental illness. Does that mean I am immune?"],
            "responses":["While family history plays a large role in developing mental illness, it is not the only factor. There are environmental and psychosocial factors that add to the risk factors. No one is immune from developing mental health illness."]
    },
     {
        "tag":"medication",
            "patterns":["What medication can i use to help with depression"],
            "responses":["Consult a medical practioner. Do not buy over the counter drugs unless instructed by the doctor"]
    },
     {
        "tag":"medication-side-effects",
            "patterns":["What are the side effects of medication?"],
            "responses":[" Like other medication, psychiatric medication has its own set of side effects like Drowsiness, Restlessness, Dizziness, Dry mouth, Constipation, Nausea, and Vomiting. It is usually because of the body getting used to medication. It normally takes a month for the body to get used to these drugs. If you are feeling any of the above symptoms, call your doctor immediately."]
    },
    {
        "tag":"children",
            "patterns":["Do children have depression?"],
            "responses":["Children may develop mental health illnesses. Their symptoms differ from adults: 1. Changes in school performance 2. Poor grades despite effort 3. Hyper activity 4. Consistent, recurring nightmares 5. Aggressive behaviour 6. Frequent, unmanageable temper tantrums"]
    },
    {
        "tag":"worry",
            "patterns":["What do I do if I am worried about my depression"],
            "responses":[" The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."]
    },
    {
        "tag":"unwell",
            "patterns":["How do I know if I am unwell?"],
            "responses":["If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."]
    },
    {
        "tag":"relative",
            "patterns":["What should I do if I’m worried about my relative? "],
            "responses":["This may depend on your relationship with them. Gently encouraging someone to seek appropriate support would be helpful to start with."]
    },
    {
        "tag":"friend",
            "patterns":["I am worried about my friend, what should i do?"],
            "responses":["This may depend on your relationship with them. Gently encouraging someone to seek appropriate support would be helpful to start with."]
    },
    {
        "tag":"command",
            "patterns":["How do I deal with someone telling me what to do?"],
            "responses":["Some people may advise you on good evidence of what works with the best of intentions, but it’s important to find out what works best for you."]
    },
    {
        "tag":"prevent",
            "patterns":["Can you prevent prevent"],
            "responses":["We can all suffer from mental health challenges in our case depression, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."]
    },
    {
        "tag":"assist-friend",
            "patterns":["Can someone visit an addiction mental health specialist for a relative?"],
            "responses":["The family's role in identifying an addiction and in motivating the client to seek treatment is often essential. Their role continues throughout the treatment and recovery phase. If the client is very resistant to suggestions of seeing a specialist, a consultation can be offered to concerned relatives, in order to help them develop a better understanding of the situation and explore measures that can be implemented until the client is ready to engage with professionals."]
    },
    {
        "tag":"alcohol-consumption",
            "patterns":["How much alcohol is considered “too much”?"],
            "responses":[" Moderate alcohol consumption is defined as having up to 1 drink per day for women and up to 2 drinks per day for men. For men, heavy drinking is defined as consuming 15 drinks or more per week. For women, heavy drinking is typically defined as consuming 8 drinks or more per week."]
    },
    {
        "tag":"addictions",
            "patterns":["Can addictions be cured?"],
            "responses":[" Many clients who currently suffer from one type of addiction or another will permanently recover, either spontaneously or with the support of a service such as ours. Others will experience relapses and hurdles over months and possibly years. Many options might need to be considered from harm reduction to residential rehabilitation in Lebanon or abroad. This is why we consider building a strong therapeutic relationship build on mutual trust and openness a cornerstone of our treatment. Strict confidentiality is respected and sharing of information takes place in the interest of the client and with his consent."]
    },
    {
        "tag":"elderly-depression",
            "patterns":["Is it normal for an older person living alone to be depressed? "],
            "responses":["It is not normal for an older person living alone, retired, or away from his/her children to feel depressed. In fact, depression in elderly people can often go untreated because many people think that depression is a normal part of aging and a natural reaction to chronic illness, loss and retirement. Many elderly people and their families also do not recognize the symptoms of depression so it can go unnoticed. According to studies done by IDRAAC, 8.6% of Lebanese older adults are depressed and females are twice more likely to develop depression than males."]
    },
    {
        "tag":"anxiety-depression",
            "patterns":["What is the meaning of anxiety and depression?"],
            "responses":[" Depression and anxiety disorders are different, but people with depression often experience symptoms similar to those of an anxiety disorder, such as nervousness, irritability, and problems sleeping and concentrating. But each disorder has its own causes and its own emotional and behavioral symptoms."]
    },
    {
        "tag":"oversleeping",
            "patterns":["Does oversleeping cause depression?"],
            "responses":["It's important to remember that oversleeping is a possible symptom of depression and that oversleeping doesn't cause depression. But it can exacerbate and worsen depression symptoms","Try to sleep for 8-10hrs. Do not exceed 10 hours and do not sleep less than 8 hours"]
    },
    {
        "tag":"lack-sleep",
            "patterns":["Can lack of sleep make you feel sad?"],
            "responses":["Studies show people who are sleep deprived report increases in negative moods (anger, frustration, irritability, sadness) and decreases in positive moods. And sleeplessness is often a symptom of mood disorders, such as depression and anxiety."]
    },
    {
        "tag":"sleep",
            "patterns":["What if i can not get enough hours?"],
            "responses":["Try to organize your time by waking up early and sleeping early. Let us try by waking up 7:00 in the morning, spend the day doing vigorous activities do not just sit down, walk around or go to the gym, then eat on time, then go to bed by 9:00pm. This gets you 10 hours of sleep."]
    },
    {
        "tag":"exercise-gym",
            "patterns":["What are some of the exercises i could do at the gym?"],
            "responses":["Depression and anxiety symptoms often improve with exercise. Here are some realistic tips to help you get started and stay motivated.Certainly running, lifting weights, playing basketball and other fitness activities like swimming that get your heart pumping can help."]
    },
    {
        "tag":"exercise-other",
            "patterns":["What other activities could i do?"],
            "responses":["Physical activity such as gardening, washing your car, walking around the block or engaging in other less intense activities.These help to improve your mood as long you get off the couch and move"]
    },
    {
        "tag":"exercise-benefits",
            "patterns":["How does exercise help depression and anxiety?"],
            "responses":["Regular exercise may help ease depression and anxiety by:Releasing feel-good endorphins, natural cannabis-like brain chemicals (endogenous cannabinoids) and other natural brain chemicals that can enhance your sense of well-being, Taking your mind off worries so you can get away from the cycle of negative thoughts that feed depression and anxiety"]
    },
    {
        "tag":"exercise-benefits1",
            "patterns":["What are some benefits of regular exercise?"],
            "responses":["Gain confidence. Meeting exercise goals or challenges, even small ones, can boost your self-confidence. Getting in shape can also make you feel better about your appearance. Get more social interaction. Exercise and physical activity may give you the chance to meet or socialize with others. Just exchanging a friendly smile or greeting as you walk around your neighborhood can help your mood.Cope in a healthy way. Doing something positive to manage depression or anxiety is a healthy coping strategy. Trying to feel better by drinking alcohol, dwelling on how you feel, or hoping depression or anxiety will go away on its own can lead to worsening symptoms."]
    },
    {
        "tag":"exercise-time",
            "patterns":["How much time is enough for exercising?"],
            "responses":["Doing 30 minutes or more of exercise a day for three to five days a week may significantly improve depression or anxiety symptoms. But smaller amounts of physical activity — as little as 10 to 15 minutes at a time — may make a difference. It may take less time exercising to improve your mood when you do more-vigorous activities, such as running or bicycling.The mental health benefits of exercise and physical activity may last only if you stick with it over the long term — another good reason to focus on finding activities that you enjoy."]
    }, 
    {
        "tag":"exercise-benefits2",
            "patterns":["How do I get started and stay motivated?"],
            "responses":["Identify what you enjoy doing. Figure out what type of physical activities you're most likely to do, and think about when and how you'd be most likely to follow through. For instance, would you be more likely to do some gardening in the evening, start your day with a jog, or go for a bike ride or play basketball with your children after school? Do what you enjoy to help you stick with it.",
            "Get your mental health professional's support. Talk to your doctor or mental health professional for guidance and support. Discuss an exercise program or physical activity routine and how it fits into your overall treatment plan.",
        "Set reasonable goals. Your mission doesn't have to be walking for an hour five days a week. Think realistically about what you may be able to do and begin gradually. Tailor your plan to your own needs and abilities rather than setting unrealistic guidelines that you're unlikely to meet.",
    "Don't think of exercise or physical activity as a chore. If exercise is just another should in your life that you don't think you're living up to, you'll associate it with failure. Rather, look at your exercise or physical activity schedule the same way you look at your therapy sessions or medication — as one of the tools to help you get better.",
"Analyze your barriers. Figure out what's stopping you from being physically active or exercising. If you feel self-conscious, for instance, you may want to exercise at home. If you stick to goals better with a partner, find a friend to work out with or who enjoys the same physical activities that you do. If you don't have money to spend on exercise gear, do something that's cost-free, such as regular walking. If you think about what's stopping you from being physically active or exercising, you can probably find an alternative solution.",
"Prepare for setbacks and obstacles. Give yourself credit for every step in the right direction, no matter how small. If you skip exercise one day, that doesn't mean you can't maintain an exercise routine and might as well quit. Just try again the next day. Stick with it."]
    },
    {
        "tag":"exercise-benefits3",
            "patterns":["Do i need to see my doctor?"],
            "responses":["Check with your doctor before starting a new exercise program to make sure it's safe for you. Talk to your doctor to find out which activities, how much exercise and what intensity level is OK for you. Your doctor will consider any medications you take and your health conditions. He or she may also have helpful advice about getting started and staying motivated.",
        "If you exercise regularly but depression or anxiety symptoms still interfere with your daily living, see your doctor or mental health professional. Exercise and physical activity are great ways to ease symptoms of depression or anxiety, but they aren't a substitute for talk therapy (psychotherapy) or medications."]
    },
    {
        "tag":"diabetes",
            "patterns":["Is depression a side effect of diabetes?"],
            "responses":["If you have diabetes — either type 1 or type 2 — you have an increased risk of developing depression. And if you're depressed, you may have a greater chance of developing type 2 diabetes. The good news is that diabetes and depression can be treated together."]
    },
     {
        "tag":"diabetes1",
            "patterns":[" Can low blood sugar cause suicidal thoughts?"],
            "responses":["The observed association between plasma glucose levels, insulin resistance and suicidal behaviour suggests that disturbances in glucose metabolism are associated with suicidal ideation and attempts."]
    },
    {
        "tag":"anxiety",
        "patterns":["How long can Anxiety last?"],
        "responses":["Anxiety attacks usually peak within 10 minutes, and they rarely last more than 30 minutes. But during that short time, you may experience terror so severe that you feel as if you're about to die or totally lose control."]
    },
    {
        "tag":"anxiety1",
        "patterns":["What are the stages of anxiety?"],
        "responses":["Anxiety levels are typically classified by the level of distress and impairment experienced into four categories namely, mild anxiety, moderate anxiety, severe anxiety and panic level anxiety."]
    },
    {
        "tag":"anxiety2",
        "patterns":["At what age does anxiety peak?"],
        "responses":["Adults ages 30 to 44 have the highest rate of anxiety of this age group, with around 23% of people this age reporting an anxiety disorder within the past year."]
    },
    {
        "tag":"anxiety3",
        "patterns":["Why is anxiety bad for you?"],
        "responses":["Anxiety disorders can cause rapid heart rate, palpitations, and chest pain. You may also be at an increased risk of high blood pressure and heart disease. If you already have heart disease, anxiety disorders may raise the risk of coronary events."]
    },
    {
        "tag":"anxiety4",
        "patterns":["What is the 3 3 3 rule for anxiety?"],
        "responses":["There's an anxiety-reducing technique called grounding. There are different versions of this, but an easy one to remember is the 3-3-3 rule. Mentally note three things you see, three sounds you hear, and then move three parts of your body. This exercise can help your mind refocus on something else."]
    },
    {
        "tag":"thoughts-control",
        "patterns":["Do we control our thoughts?"],
        "responses":["We are aware of a tiny fraction of the thinking that goes on in our minds, and we can control only a tiny part of our conscious thoughts. The vast majority of our thinking efforts goes on subconsciously. ... Slips of the tongue and accidental actions offer glimpses of our unfiltered subconscious mental life."]
    },
    {
        "tag":"thoughts-control1",
        "patterns":["How many thoughts a day do we have?"],
        "responses":["A new study has suggested that an average person has 6,200 thoughts per day. Thousands of thoughts cross our mind through the day. Many people even complain that they can't sleep immediately after going to bed as their brain does not stop thinking."]
    },
    {
        "tag":"anxiety5",
        "patterns":["How can we reduce anxiety?"],
        "responses":["3 3 3 rule is the best method to reduce anxiety.",
    "In this method you have to mentally note three things you see, three sounds you hear, and then move three parts of your body. This exercise can help your mind refocus on something else."]
    },
    {
        "tag":"ugly",
        "patterns":["I think I am ugly!"],
        "responses":["Well do you really think that? Would you like to see the most beautiful face ever? Open your WebCam and voila, the prettiest face on this planet magically appears."]
    },
    {
        "tag":"bullying",
        "patterns":["I am a victim of bullying"],
        "responses":[" Bullying is wrong and no one should be bullied.",
    " I highly recommend you to file a case against your bully."]
    },
    {
        "tag":"bullying1",
        "patterns":["I am afraid to file a case against bullying"],
        "responses":["Bullying is very wrong and you shouldn't let anyone overpower you.",
    " I highly recommend you to stand for yourself and report this to your guardian."]
    },
    {
        "tag":"bullying-types",
        "patterns":["What are types of bullying?"],
        "responses":["There is: Physical bullying, verbal bullying, social bullying and cyber bullying"]
    },
    {
        "tag":"bullying2",
        "patterns":["What is physical bullying?"],
        "responses":["Physical bullying includes hitting, kicking, tripping, pinching and pushing or damaging property.  Physical bullying causes both short term and long term damage.",
    "In this case report the bully as this cause physical harm and may lead to death if the offenders does not know how to control their own strength"]
    },
    {
        "tag":"bullying3",
        "patterns":["What is verbal bullying?"],
        "responses":["Verbal bulling includes name calling, insults, teasing, intimidation, homophobic or racist remarks, or verbal abuse. While verbal bullying can start off harmless, it can escalate to levels which start affecting the individual target.",
    "The offender does not know by doing this they can make the offendee commit suicide due to depression, so they indirectly murdered someone",
"Such cases should be avoided, in cases of resolving disputes avoid verbally bullying someone and solve the issue in a civilized manner."]
    },
    {
        "tag":"bullying4",
        "patterns":["What is social bullying?"],
        "responses":["Social bullying, sometimes referred to as covert bullying, is often harder to recognise and can be carried out behind the bullied person’s back.  It is designed to harm someone’s social reputation and / or cause humiliation.",
    "lying and spreading rumours, negative facial or physical gestures, menacing or contemptuous looks playing nasty jokes to embarrass and humiliate ,mimicking unkindly ,encouraging others to social exclude someone and damaging someone’s social reputation or social acceptance.",
"Avoid talking about other behind their backs, if you have a problem with someone talk to them face to face and solve the issues amongst yourselves."]
    },
    {
        "tag":"bullying5",
        "patterns":["What is cyber bullying?"],
        "responses":["The Cyber Bullying Research Centre defines cyber bullying as:  Intentional and repeated harm inflicted through the use of computers, phones, and other electronic devices.Cyber bullying can be overt or covert bullying behaviours using digital technologies including hardware such as computers and smartphones, and software such as social media, instant messaging, texts, websites and other online platforms.Cyber bullying can happen at any time. It can be in public or in private and sometimes only known to the target and the person bullying.",
    "It includes: abusive or hurtful texts, emails or posts, images or videos, deliberately excluding others online, nasty gossip or rumours,imitating others online or using their log-in. "]
    },
    {
        "tag":"suicide1",
        "patterns":["My time has come"],
        "responses":["Yeahh!! The time has come for you to show the world that you are the greatest person alive, and no one else can be as good as you are."]
    },
    {
        "tag":"therapy",
        "patterns":["Is psychotherapy a substitute for medication?"],
        "responses":["Psychotherapy in some cases can be sufficient for the treatment of certain mental conditions. However, it may be needed in conjunction with medication. This is why in several cases, it is not considered as a substitute for medication."]
    },
    {
        "tag":"assist",
        "patterns":["What should I do if I know someone who appears to have all of the symptoms of a serious mental disorder?"],
        "responses":["If you know someone who is having symptoms of a mental disorder, do not just think that they will snap out of it. Notify a family member, a mental health professional, a counselor if you think a friend or family member has symptoms of a mental disorder."]
    },
    {
        "tag":"warning-signs",
        "patterns":[" What are some of the warning signs of depression?"],
        "responses":["Symptoms of mental disorders vary depending on the type and severity of the condition. Some general symptoms that may suggest a mental illness include: Problems in concentration Long-lasting sadness or irritability Recurrent changes in energy Extremely high and low moods Excessive fear, worry, or anxiety Social withdrawal Dramatic changes in eating or sleeping habits Strong feelings of anger Delusions or hallucinations (seeing or hearing things that are not really there) Increasing inability to cope with daily problems and activities Suicidal thoughts Many unexplained physical problems Confused thinking Abuse of drugs and/or alcohol"]
    },
    {
        "tag":"factors",
        "patterns":["What Psychological Factors Contribute to depression? "],
        "responses":["Psychological factors that may contribute to mental illness include specific vulnerabilities such as personality traits, particular extremes in temperament features, specific sensitivities to negative emotions, cognitive susceptibility, dysfunctional attitudes, hopelessness, negative distortions."]
    },
    {
        "tag":"factors1",
        "patterns":["What Environmental Factors Contribute to depression?"],
        "responses":["Certain triggering factors could be significant stressors precipitating a mental illness such as: 1. Losses experiences (physical loss after a trauma, loss of significant others, separation, etc… 2. Chronic threats 3. Long-term exposure to traumatic conditions 4. Harmful family dynamic 5. Living in extreme deprivation and poverty 6. Alcohol and substance misuse 7. Severe neglect 8. War, natural disasters, accidents, etc… 9. Chronic pain and incapacitating chronic illness 10. Social discrimination for example towards minorities"]
    },
    {
        "tag":"assist1",
        "patterns":["Can people get over depression without medication?"],
        "responses":["Health care professionals have differing opinions on the effectiveness of medication to treat mental illness. Mental illness is a medical illness. A person does not simply get over mental illness without some form of treatment. Mental illness is generally a lifelong, chronic medical illness that needs consistent treatment."]
    },
    {
        "tag":"assist2",
        "patterns":["Can people stabilize a mental illness simply with medication alone?"],
        "responses":["hough medications can often aid in the treatment of mental illness, it is unlikely that taking medication as the sole form of treatment will be effective in getting over or stabilizing one's mental illness. Professionals generally recommend therapy along with medications to manage mental illness most effectively. People who suffer the mental illness of severe depression may put pressure on themselves to just get over return to active participation again, but like other mental illnesses, it takes therapy and sometimes medication to stabilize."]
    },
    {
        "tag":"routine",
        "patterns":[" Why does someone with mental illness need to have a routine?"],
        "responses":["Mental illness can often disrupt a person's life by hindering that person's ability to focus on and complete tasks that they otherwise would be able to complete. Establishing a productive daily routine can help to normalize that person's daily life and having a routine most often contributes to increased life satisfaction that comes with personal accomplishment (in the human population as a whole, not just those living with mental illness)."]
    },
    {
        "tag":"medication1",
        "patterns":["Why do some people choose to just take meds and no therapy, is that safe?"],
        "responses":["The decision to take prescription medication is one that every individual must make for his or herself. Some people do not feel comfortable divulging information to doctors or others living with mental illness in a therapy environment so they choose to rely solely on medication to combat the disturbances in their lives caused by mental illness. The question of whether it is safe to take prescription medication without partaking in therapy can best be answered by stating that it might be less effective to take medication without the benefit of therapy, but it does not seem to have been proven to be unsafe."]
    },
    {
        "tag":"exercise-benefits4",
        "patterns":[" Does exercising help control mental illness just by itself? "],
        "responses":[" By itself, exercise is unlikely to control many types of mental illness. Many health care professionals think that physical exercise has a positive effect on depression, anxiety, and other mental illnesses, though all caution that more clinical research must be done on the subject. There does seem to be a large section of the medical community that believes physical exercise, in conjunction with therapy and prescription medication, is very beneficial to persons living with mental illnesses, as it is for all people."]
    },
    {
        "tag":"race",
        "patterns":["Are there any ethnic/racial groups that more likely to have mental illnesses?"],
        "responses":["The types of mental illness and the percentage of the population with each illness is the same across cultures. Cultures vary in how mental illness is stigmatized, beliefs about the cause of mental illness, and response to different treatments. Mental Health professionals from many different fields differ in their opinions on this and related questions. One argument is that people with lower economic and social status (not ethnicity) are possibly more likely to develop mental illness due to the barriers to advancement implicit in those groups' social stature."]
    },
    {
        "tag":"acquire",
        "patterns":[" How does someone acquire a mental illness?"],
        "responses":["Scientists are still studying how people become mentally ill, so we do not know as much as we would like about how a person develops a mental disorder. There may be genetic causes or inherited vulnerabilities, prenatal care injuries or difficulties, exposure to toxins, or other unknown sources. Poverty, homelessness, overcrowding, stressful living conditions, frequent exposure to violence, abusive parents or severe marital or relationship problems can contribute to the development of a mental illness."]
    },
    {
        "tag":"chronic",
        "patterns":["Is depression a side effect of diabetes?"],
        "responses":["Chronic is defined as, lasting for a long period of time or marked by frequent recurrence or of long duration; continuing. Many, if not most, mental illnesses could be categorized as chronic in that the individual living with a certain mental illness will never get over that illness. But this is not to say that many symptoms of various mental illnesses cannot be largely alleviated through treatment. If treated correctly, many mental illnesses will have a minimal impact on those living with them."]
    },
    {
        "tag":"seizures",
        "patterns":["Can mental health cause seizures? "],
        "responses":["Psychogenic nonepileptic seizures (PNES) are sudden, involuntary seizure-like attacks that are similar to epileptic seizures, but have a psychological origin. They can be related to stress, difficult emotions, or psychological distress. Appropriate diagnosis is important, as patients with psychogenic nonepileptic seizures are sometimes misdiagnosed and treated for epilepsy. Different types of psychological therapy that can be used to treat PNES."]
    },
    {
        "tag":"difference",
        "patterns":["What is the difference between a psychiatrist, a psychologist, and a therapist?"],
        "responses":["Psychiatrists have a degree in medicine like your family physician, followed by specialized training in the diagnosis and treatment of mental illness, emotional disorders, and behavioral problems. They can prescribe medication to help people with mental health problems. Psychologists have a degree in psychology, which is the study of the mind and behaviours. Therapists and counselors can have a range of backgrounds, such as a master’s degree from a counseling program."]
    },
    {
        "tag":"assist3",
        "patterns":["Who should I talk to about mental health?"],
        "responses":["If you’re not in a crisis, a good first step you can take is simply consulting a general practitioner or family doctor. Talking with a doctor can help clarify your options and rule out physical causes for mental health problems. While it might feel difficult at first to talk to your doctor about your thoughts and feelings, this discussion may help you access the counselling services you need."]
    },
    {
        "tag":"difference1",
        "patterns":[" What’s the difference between psychotherapy and counselling? "],
        "responses":[" Though the terms counselling and psychotherapy are often used interchangeably, there is a slight and distinctive difference between them. Psychotherapy is often treatment used in response to a diagnosable mental health problem such as depression, bipolar disorder, or attention deficit hyperactivity disorder. It is often in-depth therapy that can be used in conjunction with medication. Counselling tends to be more wellness-oriented, providing increased insight, like how to effectively overcome problems and challenges."]
    },
    {
        "tag":"medication2",
        "patterns":[" What types of antidepressants can psychiatrists prescribe?"],
        "responses":["Selective serotonin reuptake inhibitors (SSRIs), like Paxil, Celexa or Lexapro, and Serotonin and norepinephrine reuptake inhibitors (SNRIs), like Cymbalta or Effexor, are antidepressants that are commonly prescribed to treat depression. Psychiatrists can also prescribe tricyclic antidepressants, like Tofranil or Pamelor, Monoamine oxidase inhibitors (MAOIs), like Marplan or Nardil, or other antidepressants like Wellbutrin, a norepinephrine and dopamine reuptake inhibitor (NDRI)."]
    },
    {
        "tag":"medication3",
        "patterns":["Can therapists prescribe medication?"],
        "responses":["Psychologists and therapists can provide important counselling services, but aren’t licensed to prescribe medications. Psychiatrists and licensed medical doctors, like general practitioners, can prescribe medications to their patients."]
    },
    {
        "tag":"suicide2",
        "patterns":[" How do I stop suicidal thoughts?"],
        "responses":["Keep in mind that things change over time. Your problems are temporary, but suicide is permanent. Taking your own life is never the right solution. No matter how bad your situation may seem or how much pain you may be experiencing right now, there are ways of dealing with these issues. Give yourself time and don’t try to manage suicidal feelings on your own. Professional help and support from loved ones can make a big difference. Numerous organizations and support groups can also help you cope with suicidal feelings."]
    },
    {
        "tag":"difference2",
        "patterns":[" What’s the difference between psychosis and neurosis?"],
        "responses":["Neurosis is a disorder that’s characterized by anxiety, depression, or other feelings of unhappiness or distress that are out of proportion to the circumstances of a person’s life. Psychosis, on the other hand, is a serious but treatable medical condition that reflects changes in how the brain functions. A person with psychosis can experience some loss of contact with reality, which is characterized by changes in their way of thinking or behaving."]
    },
    {
        "tag":"difference3",
        "patterns":["What’s the difference between anxiety and stress?"],
        "responses":["While the physical sensations of anxiety and stress can be similar, their causes are usually different. Stress is usually caused by external pressures we’re having difficulty coping with. When we’re stressed, we usually know what we’re stressed about, and the symptoms of stress generally resolve themselves once the stressful situation ends. Anxiety, on the other hand, is usually caused by worries or fears about potential threats or troubles, or even anxiety about the anxiety itself."]
    },
    {
        "tag":"difference4",
        "patterns":[" What’s the difference between sadness and depression? "],
        "responses":["Sadness is a normal reaction to some of life’s challenges. Feeling sad from time to time is a normal part of being human. If your feelings of sadness resolve themselves on their own over time and don’t impact your life in a big way, you’re probably not dealing with depression. That being said, if you continue to feel blue, it’s important to seek help, as depression doesn’t usually go away on its own. Depression is much more than low mood or sadness. Look for physical signs, such as problems with sleep, appetite, or energy."]
    },
    {
        "tag":"pay",
        "patterns":["How can I get help paying for my medication?"],
        "responses":[" Some pharmaceutical companies offer prescription assistance programs to individuals and families with financial needs, while others offer special drug discount cards. These programs typically require a doctor’s consent and proof of your financial status. They may also require that you have either no health insurance or no prescription drug benefit through your health insurance."]
    },
    {
        "tag":"medication4",
        "patterns":["If I feel better after taking medication, does this mean I am cured and can stop taking it?"],
        "responses":["It is not uncommon for people to stop taking their medication when they feel their symptoms are under control. Others may choose to stop taking their medication because of its side effects, without realizing that most side effects can be effectively managed. While it may seem reasonable to stop taking the medication, the problem is that most often, the symptoms will return. If you or your child is taking medication, it is very important that you work together with your doctor before making decisions about any changes in your treatment. Another problem with stopping medication, particularly for stopping it abruptly, is that you may develop withdrawal symptoms that can be very unpleasant. If you and your doctor feel a trial off your medicine is a good idea, it is necessary to slowly decrease the dosage of medications so that these symptoms don’t occur. It is important that your doctor and pharmacist work together to make sure your medications are working safely and effectively. You should talk with them about how you are doing and if there are side effects that make you unwilling to continue treatment. They will work with you to develop strategies for minimizing these side effects, or will create a plan for switching to a different treatment that will be a better fit."]
    },
    {
        "tag":"medication5",
        "patterns":["What should I know before starting a new medication?"],
        "responses":["The best source of information regarding medications is the physician prescribing them. He or she should be able to answer questions such as: 1. What is the medication supposed to do? 2. When should it begin to take effect, and how will I know when it is effective? 3. How is the medication taken and for how long? 4. What food, drinks, other medicines, and activities should be avoided while taking this medication? 5. What are the side effects and what should be done if they occur? 6. What do I do if a dose is missed? 7. Is there any written information available about this medication? 8. Are there other medications that might be appropriate? If so, why do you prefer the one you have chosen? 9. How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed? All medications should be taken as directed. Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects. Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks."]
    },
    {
        "tag":"treatment",
        "patterns":[" If I become involved in treatment what do I need to know? "],
        "responses":["Beginning treatment is a big step for individuals and families and can be very overwhelming. It is important to continue involvement in the treatment process as much as possible. Some questions you will need to have answered include: 1. What is known about the cause of this particular illness? 2. Are there other diagnoses where these symptoms are common? 3. Do you normally include a physical or neurological examination? 4. Are there any additional tests or exams that you would recommend at this point? 5. Would you advise an independent opinion from another psychiatrist at this point? 6. What program of treatment is the most helpful with this diagnosis? 7. Will this program involve services by other specialists? If so, who will be responsible for coordinating these services?"]
    },
    {
        "tag":"children1",
        "patterns":["How can I find a mental health professional right for my child or myself?"],
        "responses":["Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."]
    },
    {
        "tag":"therapy1",
        "patterns":["What happens in a therapy session?"],
        "responses":["Therapy is a supportive and confidential process where you will feel heard and understood. At the beginning of a therapy session, you will most likely be invited to share what’s on your mind and you and your therapist will discuss what’s been going on in your life, challenges you have been facing, and your feelings about it. Your therapist will use their expertise to help you gain a new perspective, learn more about yourself and your situation, recognize patterns of behavior that have become problematic, and develop new skills you can use in your day-to-day life to achieve your goals. Therapy is a collaborative process between you and your therapist; you will make greater progress when you actively participate in the therapeutic process."]
    },
    {
        "tag":"therapy2",
        "patterns":["How long can I expect to be in therapy?"],
        "responses":["Depending on your own unique needs, therapy can be short-term (6-12 sessions), for a specific issue or goal, or long-term, to deal with more difficult patterns or your desire for continued self-awareness and personal growth"]
    },
    {
        "tag":"therapy3",
        "patterns":["What are the known side effects of neurofeedback?"],
        "responses":["Neurofeedback has been used for over 30 years, with very few reported side effects and is considered safe for all patients. In rare cases, some individuals have reported feeling tired, foggy, or having a slight headache, while other have reported feeling energetic or really happy."]
    },
    {
        "tag":"therapy4",
        "patterns":[" Are neurofeedback and biofeedback the same thing?"],
        "responses":["Neurofeedback and biofeedback are often described as the same things. Neurofeedback is in fact a type of biofeedback; as they both are designed to specifically target brainwave patterns."]
    },
    {
        "tag":"alcohol",
        "patterns":["Can I drink alcohol while taking antidepressants?"],
        "responses":["Drinking alcohol while taking antidepressants is generally not recommended because both of these substances can make you drowsy, less alert, and uncoordinated. When taken together, those effects are increased. However, since many patients are not willing to give up alcohol completely, it is important to combine alcohol and antidepressants in the safest way possible."]
    },
    {
        "tag":"medication6",
        "patterns":["I have been taking my antidepressant medication for a while now. I feel great. All of my symptoms seem to be gone. Is it okay for me to stop taking my medication?"],
        "responses":[" It is not uncommon for people to stop taking their antidepressant medication when they feel their symptoms have become controlled. Others may choose to stop their antidepressant medication because of bothersome side effects despite their mood being better. A person may not realize that most side effects can be effectively managed. While it may seem reasonable to stop taking the medication, the problem is that at least 50% of the time the symptoms of depression and/or anxiety come back. If you are taking an antidepressant, it is very important that you work together with your doctor before making decisions about any changes in your treatment."]
    },
    {
        "tag":"sexual",
        "patterns":["I heard that medication can cause sexual side effects. Are these effects permanent? Should I stop taking my medicine?"],
        "responses":["Changes in sexual function may be caused by many things. If you notice any changes in sexual function after starting these medication your doctor can determine whether your medicine may be responsible. Some medications, such as Paxil, Prozac, Zoloft, Celexa and Lexapro, can cause sexual side effects, including lowered sex drive, delay in the time it takes for you to have an orgasm, or make you unable to have an orgasm. Not everyone who takes these medications experiences sexual side effects. These types of side effects will usually occur within the first several months of treatment if they are going to happen, and will continue as long as you take the medication."]
    },
    {
        "tag":"medicine-cost",
        "patterns":["Why do psychiatric medications cost so much?"],
        "responses":["First it is important to understand the difference between receiving a “Brand” or “Trade name” product versus a “generic” form of a medication. A “Brand” name medication has a patent that allows the manufacturer exclusive rights to sell the medication for a certain number of years. “Brand” name drugs cost more because the pharmaceutical company discovering the drug is attempting to recover the hundreds of millions of dollars it took to do the research to make sure the drug is safe and effective. Other costs involved with brand-name medications include manufacturing, distributing, and advertising. When the patent time for a brand-name medication runs out other manufacturers are allowed to make and sell “Generic” versions of the same drug. The active ingredient(s) of Generic medications are identical to the “Brand” ingredient(s) though the tablet or capsule may look slightly different in color, shape, etc., and generally is less costly. Check with your practitioner or pharmacist to discuss potential alternatives before starting or stopping medications."]
    },
    {
        "tag":"medication7",
        "patterns":["I was recently prescribed an antidepressant. The information sheet from the pharmacy said the medication may increase suicidal thoughts. Is this true?"],
        "responses":["It is true that antidepressants may increase the risk of suicidal thoughts and behavior in children and young adults up to age 24. However, studies did not show an increased risk beyond age 24. Also, studies show that older adults (ages 65 and older) taking antidepressants actually have a decreased risk of suicidal thoughts and behavior. The information sheet that came with the medication may be intimidating but if you know what signs to look for, depression can be safely treated."]
    },
    {
        "tag":"child",
        "patterns":["When a Child Needs Mental Health Assessment?"],
        "responses":["Just like adults, children can get mental health assessments that involve a series of observations and tests by professionals. Since it can be hard for very young children to explain what they’re thinking and feeling, the particular screening measures often depend on the child’s age. The doctor will also ask parents, teachers, or other caregivers about what they’ve noticed. A pediatrician can do these evaluations, or you may get referred to another professional who specializes in children’s mental health."]
    },
    {
        "tag":"therapy5",
        "patterns":["What is Hypnotherapy?","How Does Hypnotherapy Work?"],
        "responses":["Hypnotherapy is usually considered an aid to psychotherapy (counselling), rather than a treatment in itself. It helps with psychotherapy because the hypnotic state allows people to enter a deep state of relaxation that can better allow them to explore painful thoughts, feelings, and memories they might have hidden from their conscious minds. In addition, hypnosis enables people to perceive some things differently, such as blocking an awareness of pain. Hypnotherapy can be used in two ways, as suggestion therapy or for patient analysis. 1. Suggestion therapy: The hypnotic state makes the person better able to respond to suggestions. Therefore, hypnotherapy can help some people stop certain behaviours, such as smoking or nail-biting. 2. Analysis: This approach was historically used to induce a relaxed and uninhibited state to find suspected unconscious causes of a disorder or symptom, such as a traumatic past event that a person has hidden in their unconscious memory."]
    },
    {
        "tag":"therapy6",
        "patterns":["What Are the Benefits of Hypnotherapy?"],
        "responses":["The hypnotic state allows a person to be more open to discussion and suggestion. It can improve the success of other treatments for many conditions, including: 1. Phobias, fears, and anxiety 2. Sleep disorders 3. Depression 4. Stress 5. Post-trauma anxiety 6. Grief and loss It also might be used to help with pain control and to overcome habits, such as smoking or overeating. It also might be helpful for people whose symptoms are severe or who need crisis management."]
    },
    {
        "tag":"therapy7",
        "patterns":["What Are the Drawbacks/disadvantages of Hypnotherapy?"],
        "responses":["Hypnotherapy might not be appropriate for a person who has psychotic symptoms, such as hallucinations and delusions, or for someone who is using drugs or alcohol. It should be used for pain control only after a doctor has evaluated the person for any physical disorder that might require medical or surgical treatment. Some therapists use hypnotherapy to recover repressed memories they believe are linked to the person's mental disorder. However, hypnosis also poses a risk of creating false memories -- usually as a result of unintended suggestions by the therapist. For this reason, the use of hypnosis for certain mental disorders remains controversial."]
    },
    {
        "tag":"therapy8",
        "patterns":["Is Hypnotherapy Dangerous?"],
        "responses":["Hypnotherapy is not a dangerous procedure. It is not mind control or brainwashing. A therapist cannot make a person do something embarrassing or that the person doesn't want to do. The greatest risk, as discussed above, is that false memories can be created."]
    },
    {
        "tag":"therapy9",
        "patterns":["Who Performs Hypnotherapy?"],
        "responses":["Hypnotherapy is performed by a licensed or certified mental health professional who is specially trained in this technique."]
    },
    {
        "tag":"medication8",
        "patterns":["What is the impact of Vitamins on Mental Health"],
        "responses":["Various mental health conditions could have adverse effects on your lifestyle. Among them is depression, a condition that is associated with a lack of some vitamins. It is the most common mental health condition. Statistics show that more than 19 million Americans — nearly 8% of the U.S. population — have experienced depression. It affects people of all ages, races, socioeconomic backgrounds, and ethnicities. A diet that includes vitamin B complex helps boost mental health. Vitamin B deficiency could negatively influence your memory function, and cause cognitive impairment and dementia. Vitamin B contributes to the complexity of depressive symptoms. Low levels of folate have been linked to depression. Vitamin supplements such as folic acid (a synthetic form of folate also known as vitamin B9) combined with antidepressants can boost relief in women. Folic acid helps the body make healthy red blood cells."]
    },
    {
        "tag":"journaling",
        "patterns":["What are the Benefits of Journaling?"],
        "responses":["Whether you’re dealing with stress from school, burnout from work, an illness, or anxiety, journaling can help in many ways: 1. It can reduce your anxiety. 2. It helps with brooding. 3. It creates awareness. 4. It regulates emotions. 5. It encourages opening up. 6. It can speed up physical healing."]
    },
    {
        "tag":"social",
        "patterns":["What is the Impact of Social Isolation on Your Mental Health?"],
        "responses":["Social isolation can affect nearly every aspect of your mental health. Studies show that feelings of isolation can be linked to: 1. Suicidal thoughts and suicide attempts 2. Less restful sleep ‌3. Decreased ability to regulate eating ‌4. More stress, especially in the morning ‌5. Greater difficulty paying attention and doing complex tasks People of all ages are vulnerable to the effects of social isolation. If you experience loneliness as a pre-teen or teenager, for example, you’re more likely to struggle with depression in adulthood. Older adults are vulnerable emotionally and cognitively. Social isolation can cause up to a 40% increase in dementia risk."]
    },
    {
        "tag":"social1",
        "patterns":[" How to cope up with social isolcation?"],
        "responses":["No matter how old you are, it’s important to recognize when you struggle with social isolation. Noticing is the first step to developing healthy coping mechanisms. To cope with social isolation, try to: 1. Acknowledge your feelings. Sometimes it seems easier to ignore your feelings when you’re struggling, especially when it feels like you have no one to talk to. Take some time to acknowledge that things are hard. If you need to, reach out to a therapist. 2. Get outside. Being outdoors is beneficial to your mental and physical health. The natural light can help to boost your mood and the vitamin D in sunlight can ease symptoms of depression. 3. Reconnect with your interests. If you find you have more time to yourself, think about what solo hobbies you used to enjoy or always wanted to take up. Pursuing a new hobby can redirect your mind and give you something positive to think about. 4. Check in with people you know. When you’ve been isolated, it’s easy to feel that people are doing fine without you. It’s a common self-fulfilling prophecy brought on by loneliness, and it’s usually not true — unless it causes you to withdraw from others and treat them as though you know they don’t care."]
    },
    {
        "tag":"sports",
        "patterns":["Are there any Negative Effects of Sports on Mental Health?"],
        "responses":["While sports provide many benefits, they can have negative effects on the mental health of more advanced athletes, especially elite athletes. Elite athletes play at varsity, regional, national, or professional levels. 1. Stress. While sports relieve stress, sometimes they create it. Parents or coaches may push children too hard. Older athletes may place pressure on themselves to perform well. This leads to burnout, which is when an athlete’s performance worsens despite intense training. 2. Depression. Many high-profile athletes struggle with mental health issues. Researchers say certain factors may increase the risk of depression among athletes. These include injury, retirement from the sport, and performance expectations. It’s also possible that there may be underreporting of depression among athletes."]
    },
    {
        "tag":"workplace",
        "patterns":["What are those things that Affect Mental Health at Work? "],
        "responses":["Some things that may affect your mental health in the workplace include: 1. Excessive workload. A heavy workload could cause employee burnout. Burnout, or exhaustion, is a common cause of mental health problems in the workplace. Burnt out employees cannot work efficiently. This can mean losses or lessened profits for the employer. Many companies dedicate a budget to help their employees take care of their mental health. 2. Poor pay. Constant pressure to make more money eventually affects your mental health. When employees are underpaid and overworked, mental conditions like anxiety and depression are more likely to happen. 3. Stigma. Mental health is still a delicate topic for many. Not many people are comfortable speaking up about their personal mental struggles with co-workers.."]
    },
    {
        "tag":"workplace1",
        "patterns":["How to prevent Mental Health Issues in the Workplace?"],
        "responses":["When you have a mental health issue related to work, experts recommend asking for help from a professional and other people close to you. Most organizations have an employee assistance program. If you feel you need more help than what’s available through your employer, talk to your doctor. Mental health can be treated through various forms of therapy. Your doctor may prescribe medications or recommend other alternatives like psychotherapy."]
    },
    {
        "tag":"homesickness",
        "patterns":["How to Deal with Homesickness?"],
        "responses":[". Know that it’s normal. Being in a new place and missing your home, family, friends, and pets, is completely normal. It means that you have a healthy attachment to your loved ones. It will take a while to adjust to your new surroundings. 2. Attend events or take classes. Some companies or universities organise events for international employees or students, and this may encourage you to learn more about your new place of residence, and meet new people. 3. Be active. Taking part in sports and physical activities can help you take your mind off your homesickness and boost your mood. Team sports can also help you make new social connections and find social support. 4. Make friends with locals. It may help you adjust more easily to your new place if you get to know some locals, especially if you’re from somewhere that’s very different. 5. Gratitude journal. Journaling can help with your feelings of homesickness. Every night, try writing down three things you’re grateful for and three things you’re looking forward to the next day."]
    },
    {
        "tag":"yoga",
        "patterns":["How to Use Yoga to Improve Your Mental Health?"],
        "responses":["The best way to learn yoga is with a qualified teacher, either in a private session or in a group. A yoga teacher can correct your poses and show you how to modify them if necessary. You can use blocks, straps, and other items to make some poses easier. You can even do yoga in a chair instead of on the floor. It's also possible to learn yoga online or from a book or DVD. But the best way to avoid injury is to take an in-person yoga class. Once you have the basics down, you can use books and videos to help you practice. You will benefit more from yoga if you do it at home between classes, and online classes can keep your home practice interesting. If you are comfortable doing yoga at home, you can practice when you experience extra stress, sleeplessness, or other challenges."]
    },
    {
        "tag":"music",
        "patterns":["What are the benefits of listening to Music?"],
        "responses":["Whether you’re on edge or need a boost, even just one song can bring you back to a more even and healthy place. When it comes to your mental health, music can:‌‌ 1. Help you rest better. A study involving students found that listening to relaxing classical music at bedtime improved sleep quality. This activity was also associated with decreased signs of depression. ‌ 2. Lift your mood. Research shows that listening to happier music can make you feel happier, especially if you try to lift your mood while listening. There’s also evidence that formal music therapy can help with depression when used alongside other therapies. 3. Reduce stress. If you’re feeling anxious or stressed, calming music can help to settle your mind. Several studies have shown that when people undergoing surgery hear calming music, they have lower blood pressure and need less pain medication than those who don’t listen to soothing music."]
    },
    {
        "tag":"spirituality",
        "patterns":["What is the Impact of Spirituality on Mental Health?"],
        "responses":["Spirituality influences many decisions that people make. It encourages people to have better relationships with themselves, others, and the unknown. Spirituality can help you deal with stress by giving you a sense of peace, purpose, and forgiveness. It often becomes more important in times of emotional stress or illness. Many people with a mental illness get a sense of hope by talking with a religious or spiritual leader. Some mental illnesses can be seen as times when people question their value or purpose in a way that leaves them feeling pessimistic. It can be extremely helpful to include spirituality in the treatment of mental health difficulties. ‌"]
    },
    {
        "tag":"anger",
        "patterns":["What Are the Dangers of Suppressed Anger?"],
        "responses":["Suppressed, unexpressed anger can be an underlying cause of anxiety and depression. Anger that is not appropriately expressed can disrupt relationships, affect thinking and behavior patterns, and create a variety of physical problems. Chronic (long-term) anger has been linked to health issues such as high blood pressure, heart problems, headaches, skin disorders, and digestive problems. In addition, poorly managed anger can be linked to problems such as alcohol and substance abuse, crime, emotional and physical abuse, and other violent behavior."]
    },
    {
        "tag":"anger-management",
        "patterns":["How can i manage my anger", " What Steps Can I Take to Help Manage My Anger?"],
        "responses":["1. When you start feeling angry, try deep breathing, positive self-talk, or stopping your angry thoughts. 2. Avoid alcohol or illicit drugs that can make you more likely to act on angry feelings impulsively. 3. Although expressing anger is better than keeping it in, anger should be expressed in an appropriate way. 4. Seek out the support of others. Talk through your feelings and try to work on changing your behaviors. 5. Try to gain a different perspective by putting yourself in another's place. 6. Learn how to laugh at yourself and see humor in situations. 7. Practice good listening skills. Listening can help improve communication and can facilitate trusting feelings between people. This trust can help you deal with potentially hostile emotions."]
    },
    {
        "tag":"depression",
        "patterns":["Do I Have Clinical Depression?"],
        "responses":["Are you wondering if you have clinical depression? This quiz may help you tell if you're at risk. Don't hesitate to ask for help; depression can be treated. 1. Have you been in a depressed mood most of the day, nearly every day for at least two weeks? 2. Have you lost interest or pleasure in most daily activities, nearly every day for at least two weeks? 3. Have you experienced a significant weight change (at least five pounds) either loss or gain recently? 4. Has your appetite changed (increased or decreased) for an extended period? 5. Have you suffered from insomnia or hypersomnia (oversleeping), nearly every day for at least two weeks? 6. Have you felt tired or experienced a loss of energy during the day, nearly every day for at least two weeks? 7. Have you had guilty feelings or feelings of worthlessness nearly every day for at least two weeks? 8. Have you had difficulty thinking, concentrating, or making decisions nearly every day? 9. Have you had any thoughts of death or any thoughts of suicide without any specific plan? a) Did you mark yes for either question 1 or 2? b) Did you mark yes four or more times in questions 3-9? If you responded yes to both (a) and (b), you may be suffering from an episode of major depression. If your symptoms are disabling and severe over a few weeks -- and especially if you are having suicidal thoughts -- you should seek professional treatment."]
    },
    {
        "tag":"suicide3",
        "patterns":["If I’m feeling suicidal, what should I do?"],
        "responses":["Depressive episodes, as they’re called, can raise the chances of suicidal thoughts. They’re an emergency, so tell your doctor immediately or call 988 or 911 if this happens to you."]
    },
    {
        "tag":"behavior-health",
        "patterns":["Why is behavioral health important?"],
        "responses":["Behavioral health is important because it looks at a larger picture that includes mental health. It considers how a single behavior can be both a cause and effect, with consequences across multiple health domains."]
    },
    {
        "tag":"behavior-health1",
        "patterns":["What are the similarities between Mental and behavioral health? "],
        "responses":["Mental health is a component of behavioral health. Mental health is often the “why” behind certain behaviors, or the lack thereof. A 2018 study, for example, found that positive mental health features like high self-esteem predicted more beneficial behavioral outcomes among low-income inner-city youth. But behavioral health can also overlap with mental health. For example, depriving yourself of sleep is a behavior that has both physical and psychological consequences. Research has shown that inadequate sleep significantly increases the odds of experiencing regular mental distress. From a behavioral perspective, however, sleep deprivation has a larger wellness effect. It has also been associated with obesity, diabetes, and cardiovascular disease."]
    },
    {
        "tag":"eating-habits",
        "patterns":["How to change my eating habits for better mental health?"],
        "responses":["As research shows us more about how the foods we eat can affect our bodies, we gain more tools in our nutritional toolbox that we can use to help improve our overall health and mental well-being on a daily basis. Whole foods provide many nutrients that ultra-processed foods lack, which in turn supports all of our body’s functions in order to promote health and wellness. Start simple by adding a piece of fruit as a snack or by adding fresh or frozen vegetables into your meals. Take steps to decrease your intake of ultra-processed foods over time and limit them to only occasional use. Examples of ultra-processed foods would be items such as soft drinks, hot dogs, packaged cookies, or sweetened breakfast cereals"]
    },
    {
        "tag":"eating-diet",
        "patterns":["What foods should i eat to better my mental health?"],
        "responses":["One of the keys to a healthy body is making the right food choices. Eating a diet rich in fruits, vegetables, whole grains, legumes, low-fat dairy foods, and lean meats, poultry, and fish can go a long way toward lowering your risk of physical health problems.","Did you know that nutritious foods can also protect your mental health? Although no single nutrient or eating plan can cure depression, good overall nutrition is essential for your mental well-being. Eating foods that are rich in essential vitamins, minerals, complex carbohydrates, protein, and fatty acids is key to keeping your brain in good working order"]
    },
    {
        "tag":"diet1",
        "patterns":["What are the essentisl nutrients?"],
        "responses":["Your brain, like other organs, responds to what you eat and drink. It needs several vitamins, minerals, and other nutrients to stay healthy. If you deprive your brain of these essential nutrients, it can’t function properly. This can raise your risk of mental health problems."]
    },
    {
        "tag":"diet2",
        "patterns":["What are the vitamins and minerals needed?"],
        "responses":["Vitamins and minerals play a key role in your brain health. Vitamins that are particularly important for your brain include:vitamin C,vitamin D,B vitamins. To function properly, your brain also depends on minerals, such as: magnesium, selenium and zinc"]
    },
    {
        "tag":"diet3",
        "patterns":["What are complex carbohydrates"],
        "responses":["Carbohydrates serve a few purposes in nourishing your brain. At the most basic level, your brain depends on glucose for energy. This simple sugar is derived from carbohydrates in your diet. Carbohydrates also help stimulate your brain’s production of the feel-good neurotransmitter serotonin. Rather than snacking on sweets and processed grains, choose complex carbohydrates, such as those found in:fruits and vegetables,whole-grain foods,legumes.Your body converts these carbohydrates into glucose more slowly than simple carbohydrates, which are found in processed sugars and grains. As a result, complex carbohydrates provide a more stable and consistent flow of fuel to your brain."]
    },
    {
        "tag":"diet4",
        "patterns":["What amino acids are needed?"],
        "responses":["Amino acids are the building blocks of protein. They’re essential to your brain’s production of neurotransmitters. These are a type of chemical messenger that carry signals between your nerve cells.For example, serotonin is a neurotransmitter that’s responsible for feelings of contentment. It’s made from the amino acid tryptophan. Dopamine is a neurotransmitter that helps you to feel motivated. It’s derived from the amino acid phenylalanine. Your body absorbs these amino acids from foods in your diet."]
    },
    {
        "tag":"diet5",
        "patterns":["What are fatty acids and are they needed?"],
        "responses":["Fatty acids are also critical to your brain health. A large part of your brain is made up of fat, including omega-3 and omega-6 fatty acids. Your body can’t make these essential fatty acids on its own. Instead, it absorbs them from foods you eat. It’s best to get an equal balance of omega-3 and omega-6 fatty acids in your diet. Unfortunately, the typical Western diet contains excessive amounts of omega-6 fatty acids and insufficient amounts of omega-3 fatty acids."]
    },
    {
        "tag":"diet6",
        "patterns":["Do i need to hydrate too?"],
        "responses":["One final important nutrient for your brain is water. It makes up the majority of your brain mass. Even mild dehydration can lead to mental health symptoms, such as irritability and loss of concentration."]
    },
    {
        "tag":"diet7",
        "patterns":["What foods am i to eat?"],
        "responses":["To help your brain function properly, eat a variety of foods that are rich in essential nutrients, including: vitamin C: citrus fruits, leafy green vegetables, and other fruits and vegetables, vitamin D: salmon, cod, shrimp, eggs, and fortified milk, juice, and cereal products, B vitamins: red meat, fish, eggs, dairy products, whole grains, and leafy green vegetables, magnesium, selenium, and zinc: nuts, seeds, whole grains, green vegetables, and fish, complex carbohydrates: whole grain breads and cereals, brown rice, quinoa, millet, legumes, and starchy vegetables, such potatoes, corn, peas, and winter squash,tryptophan: lean red meat, poultry, eggs, and beans, phenylalanine: lean red meat, chicken, eggs, dairy products, soybeans, and seeds, omega-3 fatty acids: salmon, trout, tuna, beans, walnuts, broccoli, cauliflower, spinach, cantaloupe, chia and hemp seeds, and canola and flax seed oil,omega-6 fatty acids:poultry, eggs, grains, and vegetable oil."]
    },
    {
        "tag":"diet8",
        "patterns":["What foods am i to avoid"],
        "responses":["Try to avoid or limit these foods and beverages:caffeinated drinks, such as tea, coffee, and soft drinks, alcoholic drinks, sugary foods, deep-fried foods, refined and processed foods. Many refined and processed foods, sugary foods, and deep-fried foods are high in calories and low in brain-healthy nutrients. Eating too many of them can raise your risk of physical and mental health problems."]
    },
    {
        "tag":"diet9",
        "patterns":["Why is eat important to have a proper diet?"],
        "responses":["Eating healthy is important to not only your physical health, but your mental well-being too. Incorporating a wide variety of fruits, vegetables, whole grains, low-fat dairy foods, and lean meats, poultry, and fish into your diet can help you stay healthy and energized. Along with exercising regularly and getting enough sleep, eating a well-balanced diet can do wonders for your mental well-being."]
    },
    {
        "tag":"diet10",
        "patterns":["Can you generate/make a meal plan based on the recommended foods?"],
        "responses":["Sure! Just follow the diet plan below: Day1: Breakfast: Oatmeal with berries and nuts, Lunch: Tuna salad sandwich on whole-wheat bread with a side of green salad, Dinner: Grilled salmon with roasted vegetables Day 2: Breakfast: Scrambled eggs with whole-wheat toast and avocado, Lunch: Leftover grilled salmon with a side of quinoa,  Dinner: Chicken stir-fry with brown rice  Day 3:Breakfast: Smoothie made with spinach, banana, yogurt, and protein powder, Breakfast: Smoothie made with spinach, banana, yogurt, and protein powder,Lunch: Lentil soup with a side of whole-grain crackers,  Dinner: Baked tofu with roasted sweet potatoes and broccoli  Day 4: Breakfast: Whole-wheat pancakes with berries and maple syrup, Lunch: Turkey sandwich on whole-wheat bread with a side of fruit salad, Dinner: Baked cod with roasted carrots and Brussels sprouts  Day 5: Breakfast: Greek yogurt with granola and honey, Lunch: Salad with grilled chicken, mixed greens, vegetables, and a vinaigrette dressing, Dinner: Veggie burger on a whole-wheat bun with sweet potato fries Day 6: Breakfast: Overnight oats with berries and nuts, Lunch: Leftover veggie burger with a side of fruit salad, Dinner: Shrimp scampi with whole-wheat pasta  Day 7: Breakfast: Whole-wheat waffles with fruit and whipped cream, Lunch: Leftover shrimp scampi with a side of steamed vegetables, Dinner: Homemade pizza with whole-wheat crust, vegetables, and lean protein.", 
        "This meal plan provides a variety of nutrient-rich foods that can help to support brain function. It is important to note that this is just a sample plan, and you may need to adjust it based on your individual dietary needs and preferences."]
    },
    {
        "tag":"depression1",
        "patterns":["What About Depression Later In Life?"],
        "responses":["For older adults who experience depression for the first time later in life, other factors, such as changes in the brain or body, may be at play. For example, older adults may suffer from restricted blood flow, a condition called ischemia. Over time, blood vessels become less flexible. They may harden and prevent blood from flowing normally to the body’s organs, including the brain. If this occurs, an older adult with no family or personal history of depression may develop what some doctors call “vascular depression.” Those with vascular depression also may be at risk for a coexisting cardiovascular illness, such as heart disease or a stroke."]
    },
    {
        "tag":"depression2",
        "patterns":["What Efforts Are Underway To Improve Treatment Of Depression? "],
        "responses":["Researchers are looking for ways to better understand, diagnose and treat depression among all groups of people. Studying strategies to personalize care for depression, such as identifying characteristics of the person that predict which treatments are more likely to work, is an important goal."]
    },
    {
        "tag":"depression3",
        "patterns":["How Can Treatment-Resistant Depression Be Treated?"],
        "responses":["Treatment of resistant depression has most commonly been treated with electroconvulsive therapy (ECT). ECT has been modified to avoid the pain previously associated with it and is the most effective and quick-acting treatment for resistant depression. The downside is that it works by inducing brain seizures and can impair memory. Its therapeutic benefits can also fade over time. New methods of brain stimulation also offer the possibility of relief. These technologies exploit the fact that the brain is an electrical organ: it responds to electrical and magnetic stimulation to modulate brain circuits and change brain activity."]
    },
    {
        "tag":"depression4",
        "patterns":["What are the risks of untreated depression?"],
        "responses":["Untreated depression can increase risk of depressive episodes becoming more frequent, prolonged and/or severe over time and increase risk of suicide. It can significantly interfere with one’s functioning at work, school, and/or in interpersonal relationships. Depression can also increase risk of alcohol and/or substance use disorders. Additionally, depression can worsen the course and outcome of chronic medical conditions, such as diabetes, cardiovascular disease, and others."]
    },
    {
        "tag":"depression5",
        "patterns":[" What are other psychiatric conditions that can co-exist with depression? "],
        "responses":["Anxiety disorders and substance use disorders are some of the psychiatric conditions commonly found co-existing with major depressive disorder. Other psychiatric conditions too, such as post traumatic stress disorder (PTSD), eating disorders, can co-occur with depression."]
    },
    {
        "tag":"self-management",
        "patterns":["What is self-management?"],
        "responses":["Self-management courses can help you better understand your mental health condition and consider what helps you stay well. They can also help you plan for times when you’re unwell or in a crisis. They’re often designed and/or delivered by people with lived experience of mental ill-health. Courses usually include: 1. information about your condition and ways to treat it 2. ways to recognise early warning signs of a relapse 3. coping skills to deal with your symptoms They can also help you feel more assertive when asking mental health services for the support you need. Courses are free and provided by the NHS as well as other groups and organisations. Some are in-person, while others are online - either through live video calls or online videos you can work through at your own pace. As well as courses, self-management can include webinars, health and wellbeing plans you can complete yourself, or wellness recovery action plans (WRAPS)."]
    },
    {
        "tag":"self-management1",
        "patterns":["Is self-management right for me?"],
        "responses":["Courses can cover challenging topics, so it might not be right for you if you’re unwell or have recently been hospitalised for your mental health condition. You also have to be able to manage being in a group, often for several hours at a time."]
    },
    {
        "tag":"self-management-courses",
        "patterns":["How do self-management courses work? "],
        "responses":["Self-management courses are based on the principle that you know what works best for you – better than anyone else. During a course, you'll typically learn to: 1. recognise what triggers a relapse in your mental health condition 2. spot the early warning signs of a relapse 3. identify what, if anything, can prevent a relapse 4. figure out which coping strategies work best for you 5. tap into other sources of support like local peer support groups 6. build coping strategies into your life 7. make an action plan 7. draw up an advance decision and/or advance statement setting out how you'd like to be treated if you ever lack the mental capacity to make decisions about treatment in the future"]
    },
    {
        "tag":"self-management-courses1",
        "patterns":["How can I find a self-management course?"],
        "responses":["Ask your GP or other health worker involved in your care about self-management courses on the NHS, or search online to find out what’s available in your area. You may need a referral or be able to refer yourself. Other organisations also run self-management courses, such as: 1. Self Management UK runs free courses that look at the challenges that can come with a mental health condition and ways to deal with them. 2. Bipolar UK has a series of free self-management webinars that can help you understand bipolar disorder, learn different approaches to managing it, identify your triggers, and more. 3. If you live in Scotland, Bipolar Scotland runs a self-management course that teaches you how to recognise your early warning signs and take action to prevent your mood from escalating to severe depression or mania."]
    },
    {
        "tag":"anxiety6",
        "patterns":["Does generalized anxiety disorder run in families?"],
        "responses":["Having a family member with GAD appears to heighten one’s risk slightly for developing it. The family influence appears to be related to both genetic and environmental sources. There may be, for instance, a genetic predisposition for a person to be at greater risk for having generalized anxiety disorder, but it’s not something activated in everyone who has the predisposition."]
    },
    {
        "tag":"anxiety7",
        "patterns":[" Where else can I go to learn more about anxiety and mood disorders?"],
        "responses":["1. Anxiety B.C. www.anxietyBC.com 2. Anxiety Disorders Association of Canada www.anxietycanada.ca 3. Anxiety Disorders Association of Ontario www.anxietydisordersontario.ca 4. MAC Anxiety Research Centre (McMaster University) www.macanxiety.com 5. Social Phobia/Social Anxiety Association www.socialphobia.org 6. The Ontario Obsessive Compulsive Disorder Network www.ocdontario.org 7. The Panic Center www.paniccenter.net"]
    },
    {
        "tag":"ptsd",
        "patterns":["What Is Post-Traumatic Stress Disorder?"],
        "responses":["Post-Traumatic Stress Disorder (PTSD) is an anxiety disorder that can develop after exposure to a terrifying event or ordeal in which grave physical harm occurred or was threatened. After traumatic events, such as death, an earthquake, war, car accidents, floods or fires, it is not uncommon for people to experience feelings of heightened fear, worry, sadness or anger. If the emotions persist, however, or become severe, or the person gets triggered into reliving the event in their daily life, this can affect the person’s ability to function and may be a sign of PTSD."]
    },
    {
        "tag":"stress",
        "patterns":["Are There Coping Factors To Help Deal Effectively With Stress?"],
        "responses":["In their 20 years of treating and studying trauma survivors, Drs. Dennis Charney and Steven Southwick have identified ten common practices in people who have shown resilience in the face of extreme stress: 1. Maintaining an optimistic but realistic outlook 2. Facing fear (ability to confront one’s fears) 3. Reliance upon own inner, moral compass 4. Turning to religious or spiritual practices 5. Seeking and accepting social support 6. Imitation of sturdy role models 7. Staying physically fit 8. Staying mentally sharp 9. Cognitive and emotional flexibility (finding a way to accept that which cannot be changed) 10. Looking for meaning and opportunity in the midst of adversity"]
    },
    {
        "tag":"OCD",
        "patterns":["What is OCD?", "How to treat OCD?"],
        "responses":["There’s no cure for OCD. But you may be able to manage how your symptoms affect your life through medicine, therapy, or a combination of treatments. Treatments include: 1. Psychotherapy. Cognitive behavioral therapy (CBT) can help change your thinking patterns. In a form called exposure and response prevention, your doctor will put you in a situation designed to create anxiety or set off compulsions. You’ll learn to lessen and then stop your OCD thoughts or actions. 2. Relaxation. Simple things like meditation, yoga, and massage can help with stressful OCD symptoms. 3 .Medication. Psychiatric drugs called selective serotonin reuptake inhibitors help many people control obsessions and compulsions. They might take 2 to 4 months to start working. Common ones include citalopram (Celexa), clomipramine (Anafranil), escitalopram (Lexapro), fluoxetine (Prozac), fluvoxamine, paroxetine (Paxil), and sertraline (Zoloft). If you still have symptoms, your doctor might give you antipsychotic drugs like aripiprazole (Abilify) or risperidone (Risperdal). 4. Neuromodulation. In rare cases, when therapy and medication aren’t making enough of a difference, your doctor might talk to you about devices that change the electrical activity in a certain area of your brain. One kind, transcranial magnetic stimulation, is FDA-approved for OCD treatment. It uses magnetic fields to stimulate nerve cells. A more complicated procedure, deep brain stimulation, uses electrodes that are implanted in your head."]
    },
    {
        "tag":"drugs",
        "patterns":["What is the evidence on vaping?"],
        "responses":["Though less harmful than smoking cigarettes, vaping still carries potential harms. There is a small exposure to nicotine and possible carcinogens in the vapour. (A carcinogen is a substance that has the potential to cause cancer). Some evidence suggests that young people may be unaware the vaping liquid often contains nicotine. E-cigarettes are not controlled and the nicotine content of vaping liquids varies significantly among brands. Other chemicals, flavourings, and heavy metals present in vaping liquids, have not as yet been well studied. Long-term health risks from vaping are thus undetermined. More research is needed in these areas. Marketing strategies for vaping products, often on social media, are designed to appeal to young people. The range of flavours available, especially those that are fruity and sweet, and the look and feel of vaping devices attract youth. Young people can see vaping as fun and a way to socialize with friends and 'smoke' in a less harmful way."]
    },
    {
        "tag":"substance",
        "patterns":["When is substance use a problem? Where can I go for help?"],
        "responses":[" Each person has a different relationship with substances like alcohol and other drugs, and people use substances for different reasons. What’s beneficial for some may cause problems for others, or for the same person in different situations. If you or someone you care about needs more help, contact the Alcohol and Drug Information Referral Service to find support in your area. To get help anywhere in BC, call 1-800-663-1441. In Greater Vancouver, call 604-660-9382."]
    },
    {
        "tag":"drug-abuse",
        "patterns":["How can I find help for an alcohol or drug use problem?"],
        "responses":["Seeking to make changes in the way you use substances like alcohol or other drugs? This can be an important step! One way to get help is to talk to a doctor you trust and feel comfortable confiding in. If you aren’t comfortable talking in person, you can also get advice from a registered nurse (along with advice on programs or services in your area) by calling HealthLink BC at 8-1-1. Since some drugs are illegal, many people worry about what might happen if they talk about drug use. It’s important to know that in most cases, doctors have to protect your privacy—it’s the law. In BC, the Alcohol and Drug Information Referral Service can help you find information on treatment options, support groups and other resources throughout the province. It’s free, confidential, and available 24/7. Call the Alcohol and Drug Information Referral Service at 1-800-663-1441 or 604-660-9382 in the Lower Mainland."]
    },
    {
        "tag":"alcohol-abuse",
        "patterns":["How do I know if I’m drinking too much?"],
        "responses":["Sorting out if you are drinking too much can be complicated. You are unique and your relationship with alcohol is unique. No one has the same combination of life experiences and influences that you do. So even though you and your friend may choose to drink, how and why you use alcohol may be different. Whenever you decide to drink alcohol, it is helpful to know what steps you can take to ensure that your drinking behaviour is the most rewarding and least harmful possible. The following are some useful guidelines to consider. 1. Managing how much you drink on a given occasion helps decrease risky behaviours. 2. Drink slowly and alternate between non-alcoholic and alcoholic beverages. 3. Drinking in moderation helps to reduce harms to ourselves and others over time. 4. Keep less alcohol at home and set limits on how much you are going to drink each week, avoiding drinking on some days. 5. If going to a bar, stay with a group and choose an establishment that is well lit and near safe transportation options."]
    },
    {
        "tag":"food-abuse",
        "patterns":["How do I know if I have an unhealthy relationship with food? "],
        "responses":["To understand what an unhealthy relationship with food looks like, it can be helpful to first have an idea of what a healthy one looks like. A healthy relationship with food can take some work and conscious effort, but it is well worth the work because it allows us to have a flexible, healthy, and balanced relationship with our eating habits and food in general. What are some signs of a healthy relationship with food: 1. Moving away from dieting and strict rules around food and eating 2. Being aware of what your body needs and its natural hunger cues 3. Focusing on nutrition over calories"]
    },
    {
        "tag":"past-difficulties",
        "patterns":["Do past or current difficulties in life mean I’ll develop a mental health condition?"],
        "responses":[" No. Many people experience major stress in life, including poverty, unemployment, trauma, abuse, family difficulties, or chronic health problems. Experiencing these stressful situations does not mean you will definitely develop a mental health condition. But if you do experience serious, stressful situations and develop a mental health condition, know that it is not your fault. You can get help and treatment for mental health conditions. Learning ways to manage stress and reaching out for help when you need it can help you protect your mental health."]
    }, 
    {
        "tag":"drug1",
        "patterns":["How does smoking, drinking alcohol, or misusing drugs affect mental health?"],
        "responses":["The chemicals in tobacco and alcohol can change the chemicals in your brain, making you more likely to feel depressed or anxious. People with mental health conditions are also more likely to smoke and drink alcohol. Using illegal drugs, or misusing prescription drugs, is also linked to mental health conditions. Researchers are not sure whether drugs can cause mental health conditions, whether mental health conditions cause addiction, or whether both are linked to another health problem. People who have experienced trauma, whether physical or emotional (or both), are more likely to misuse drugs and alcohol."]
    },
    {
        "tag":"age",
        "patterns":["How does aging affect my mental health?"],
        "responses":["As you age, your body and brain change. These changes can affect your physical and mental health. Older women may face more stressful living or financial situations than men do, because women live longer on average. They may also have spent more time staying home to raise children or care for loved ones instead of working outside of the home. In the years leading up to menopause (perimenopause), women may experience shifts in mood because of hormone changes. They may also experience hot flashes, problems sleeping, and other symptoms that can make it harder to deal with stress or other life changes."]
    },
    {
        "tag":"trauma1",
        "patterns":["How do traumatic or negative childhood events affect mental health?"],
        "responses":["Two out of every 3 women have experienced at least one serious traumatic or negative event during childhood, increasing their risk of adult health problems, including mental health conditions. 1. Traumatic events can include physical or sexual abuse, neglect, bullying, neighbourhood violence, natural disasters, terrorism, and war. 2. Negative events during childhood can include abuse (physical, emotional, verbal, or sexual), neglect, or a problem with an adult in the home, such as seeing domestic violence or having a caregiver go to prison. The more negative childhood events you have experienced, the higher your risk of a serious health problem as an adult. Women are more likely than men to experience certain types of trauma, such as sexual abuse or assault, and are at higher risk of developing a mental health condition."]
    },
    {
        "tag":"women",
        "patterns":["Why is women’s mental health important?"],
        "responses":["Mental disorders can affect women and men differently. Some disorders are more common in women, such as depression, anxiety, and eating disorders. There are also certain disorders that are unique to women. For example, some women experience symptoms of depression at times of hormone change, such as during or after pregnancy (perinatal depression), around the time of their period (premenstrual dysphoric disorder), and during menopause (perimenopause-related depression)."]
    },
    {
        "tag":"women1",
        "patterns":["What causes depression in women?"],
        "responses":["Depression is a complex mental health condition that affects millions of people worldwide. Women are more likely than men to experience depression, with one in five women experiencing a depressive episode in their lifetime. There are many possible causes of depression, and it is often caused by a combination of factors."]
    },
    {
        "tag":"women1",
        "patterns":["What are these factors in women?"],
        "responses":["There are biological factors, psychological factors, social factors, and other factors."]
    },
    {
        "tag":"women2",
        "patterns":["What are the biological factors in women?"],
        "responses":["Genetics: Depression can run in families, and having a family history of depression increases your risk of developing the condition.Hormones: Fluctuations in hormones, such as those that occur during pregnancy, childbirth, and menopause, can also trigger depression in some women.Brain chemistry: Depression is thought to be caused by imbalances in certain chemicals in the brain, such as serotonin, norepinephrine, and dopamine."]
    },
    {
        "tag":"women3",
        "patterns":["What are the psychological factors in women?"],
        "responses":["Stress: Chronic or severe stress can lead to depression.Trauma: Experiencing a traumatic event, such as abuse, assault, or natural disaster, can increase your risk of developing depression.Negative thinking patterns: People with depression often have negative thoughts about themselves, the world, and the future. Low self-esteem: Low self-esteem can make it difficult to cope with stress and adversity, and it can also contribute to feelings of depression."]
    },
    {
        "tag":"women4",
        "patterns":["What are the social factors in women?"],
        "responses":["Loneliness and isolation: Social isolation and loneliness can increase your risk of developing depression.Relationship problems: Relationship problems, such as conflict, abuse, or divorce, can also trigger depression.Poverty: Poverty can lead to stress, anxiety, and hopelessness, all of which can contribute to depression."]
    },
    {
        "tag":"women5",
        "patterns":["What are those other factors in women?"],
        "responses":["Medical conditions: Certain medical conditions, such as cancer, heart disease, and chronic pain, can increase your risk of developing depression.Substance use: Substance use, such as alcohol and drug abuse, can also increase your risk of developing depression."]
    },
    {
        "tag":"men",
        "patterns":["What are the causes of depression in men?"],
        "responses":["it's the same as that of women but in terms of hormones there are those that occur during puberty and aging, can also trigger depression in some men."]
    },
    {
        "tag":"depression6",
        "patterns":["What are types of depression?"],
        "responses":["Major Depressive Disorder (MDD) is the most common type of depression. It is characterized by a persistent feeling of sadness, loss of interest, and changes in appetite, sleep, and energy levels.Persistent Depressive Disorder (PDD), also known as dysthymia, is a chronic form of depression that lasts for at least two years. The symptoms of PDD are less severe than those of MDD, but they can still be disabling.Bipolar Disorder is a mental health condition that causes extreme mood swings. People with bipolar disorder experience periods of mania (high energy, irritability, and decreased need for sleep) and depression.Seasonal Affective Disorder (SAD) is a type of depression that occurs during the winter months, when there is less sunlight. Symptoms of SAD include sadness, fatigue, and changes in appetite and sleep.Peripartum Depression is a type of depression that occurs during pregnancy or after childbirth. Symptoms of peripartum depression include sadness, anxiety, and irritabilityPsychotic Depression is a type of depression that occurs with psychosis, which is a loss of contact with reality. Symptoms of psychotic depression include delusions (false beliefs) and hallucinations (hearing or seeing things that aren't there).Atypical Depression is a type of depression characterized by mood reactivity, hypersomnia, and leaden paralysis. Mood reactivity is the tendency to experience changes in mood that are triggered by external events. Hypersomnia is excessive sleep. Leaden paralysis is a feeling of heaviness and fatigue in the limbs."]
    },
    {
        "tag":"treatment1",
        "patterns":["What therapy can treat SAD?"],
        "responses":["Light therapy: Light therapy is a treatment for SAD that involves exposure to bright light."]
    },
    {
        "tag":"treatment2",
        "patterns":["What therapy can be used to treat peripartum depression?"],
        "responses":["Hormone therapy: Hormone therapy may be used to treat peripartum depression."]
    },
    {
        "tag":"treatment3",
        "patterns":["What is Electroconvulsive therapy(ECT)?", "What does ECT treat?"],
        "responses":["Electroconvulsive therapy (ECT): ECT is a treatment for severe depression that involves passing an electrical current through the brain.", "Electroconvulsive therapy (ECT), also known as shock therapy, is a medical procedure that involves passing an electric current through the brain to intentionally trigger a brief seizure. It is a safe and effective treatment for severe depression that has not responded to other treatments, such as medication and psychotherapy.Electroconvulsive therapy (ECT), also known as shock therapy, is a medical procedure that involves passing an electric current through the brain to intentionally trigger a brief seizure. It is a safe and effective treatment for severe depression that has not responded to other treatments, such as medication and psychotherapy.Electroconvulsive therapy (ECT) medical procedureOpens in a new window pt.slideshare.net. Electroconvulsive therapy (ECT) medical procedure. ECT is typically administered under general anesthesia, so you will not feel any pain during the procedure. During ECT, electrodes are placed on your head. The electric current is then passed through your brain for a few seconds. This causes a seizure, which typically lasts for about 30 seconds.ECT is thought to work by changing the levels of certain chemicals in the brain, such as serotonin and dopamine. These chemicals are thought to play a role in mood regulation.ECT is a very effective treatment for severe depression. In fact, it is one of the most effective treatments available for this condition. Studies have shown that ECT can be effective for up to 80% of people who have not responded to other treatments.ECT is a safe procedure when it is administered correctly by a trained professional. The most common side effects of ECT are short-lived and include headache, nausea, and memory problems.ECT is typically given as a series of treatments, usually 2-3 times per week for 2-4 weeks. The number of treatments needed will vary depending on the individual's response to treatment.ECT is not a cure for depression, but it can be a life-saving treatment for people who have not responded to other treatments. If you are struggling with severe depression, talk to your doctor about whether ECT may be right for you."]
    }
    ]
}